{
  "!": 119,
  "!!": 6283,
  "!!!": 25694,
  "!!!!": 19678,
  "!!!!!!!!": 40891,
  "!!\\": 44412,
  "!\"": 14810,
  "!\")": 20562,
  "!\"));": 46984,
  "!\");": 6903,
  "!\",": 12688,
  "!\";": 31984,
  "!$": 39753,
  "!'": 28295,
  "!')": 29177,
  "!');": 20581,
  "!',": 21548,
  "!(": 14484,
  "!)": 29929,
  "!--": 12461,
  "!.": 37753,
  "!</": 38329,
  "!=": 3817,
  "!=\"": 15379,
  "!='": 23925,
  "!=(": 32892,
  "!=-": 25078,
  "!==": 5456,
  "!==!": 49855,
  "!==\"": 20511,
  "!==-": 42253,
  "!=|": 35289,
  "![": 25609,
  "!\\": 7131,
  "!|": 29991,
  "!|&&": 45994,
  "\"": 120,
  "\"!=": 14648,
  "\"!==": 22178,
  "\"\"": 1186,
  "\"\"\"": 3947,
  "\"\"\")": 31887,
  "\"\").": 43607,
  "\"\",": 18041,
  "\"\":": 17353,
  "\"\";": 29228,
  "\"\">": 29775,
  "\"#": 31418,
  "\"%": 8995,
  "\"%(": 39533,
  "\"&&": 13162,
  "\"&&(": 23006,
  "\"'": 11075,
  "\"')": 36187,
  "\"');": 31903,
  "\"',": 9862,
  "\"';": 32712,
  "\"(": 16266,
  "\")": 807,
  "\")!=-": 48999,
  "\")&&": 19890,
  "\")&&(": 26410,
  "\")(": 37603,
  "\"))": 2009,
  "\"))&&": 32906,
  "\")))": 12121,
  "\")));": 10135,
  "\")),": 9904,
  "\")).": 12188,
  "\")):": 22271,
  "\"));": 2149,
  "\")){": 12902,
  "\"))}": 48337,
  "\")+": 26545,
  "\")+\"": 28227,
  "\"),": 1576,
  "\"),\"": 37438,
  "\"),{": 37393,
  "\")->": 21756,
  "\").": 1785,
  "\"):": 7747,
  "\");": 659,
  "\");\\": 22515,
  "\");}": 40211,
  "\")==": 39736,
  "\")?": 17421,
  "\")?\"": 24027,
  "\")[": 11077,
  "\")]": 5237,
  "\")])": 46647,
  "\")]),": 48200,
  "\"){": 8399,
  "\")||": 14054,
  "\")||(": 32453,
  "\")}": 11127,
  "\")})": 33662,
  "\")})}": 49238,
  "\")},": 10704,
  "\")};": 21729,
  "\")}}": 44127,
  "\"+": 3982,
  "\"+\"": 18690,
  "\"+(": 32572,
  "\",": 475,
  "\",!": 15985,
  "\",\"": 1266,
  "\",\"\"": 25540,
  "\",\"\",": 22313,
  "\",\"#": 49392,
  "\",\"$": 29989,
  "\",\"%": 22980,
  "\",\"+": 39667,
  "\",\".": 23026,
  "\",\"./": 43314,
  "\",\"[": 30893,
  "\",\"\\": 37490,
  "\",\"\\\\": 46173,
  "\",$": 26817,
  "\",&": 26101,
  "\",'[": 24931,
  "\",(": 31472,
  "\",[": 29154,
  "\",[\"": 33715,
  "\",[],": 48064,
  "\",\\": 32036,
  "\",_": 33472,
  "\",{": 8795,
  "\"-": 26320,
  "\"--": 43364,
  "\".": 2735,
  "\".$": 17346,
  "\".',": 37302,
  "\"./": 29738,
  "\"/": 12752,
  "\"/,": 46761,
  "\"/>": 4387,
  "\"/>,": 44030,
  "\"/>.": 16953,
  "\"/>.</": 23228,
  "\"/></": 29495,
  "\":": 813,
  "\":!": 38463,
  "\":\"": 3718,
  "\":\"\"": 42901,
  "\":\"\",\"": 32723,
  "\":\"+": 36772,
  "\":\",": 26302,
  "\":\".": 38820,
  "\":(": 34534,
  "\":[": 21263,
  "\":[\"": 21578,
  "\":[[": 46726,
  "\":[{": 41674,
  "\":[{\"": 47672,
  "\":{": 13454,
  "\":{\"": 14257,
  "\";": 997,
  "\";\\": 36580,
  "\";}": 31677,
  "\"<": 19658,
  "\"</": 22044,
  "\"<<": 39401,
  "\"==": 5383,
  "\"===": 10801,
  "\"=>": 23251,
  "\"=>\"": 37778,
  "\"=>$": 36789,
  "\">": 1196,
  "\">%": 37047,
  "\">&": 48012,
  "\">'": 11048,
  "\">'+": 27945,
  "\">',": 26888,
  "\">'.$": 43775,
  "\">';": 19250,
  "\"><": 8220,
  "\"></": 4544,
  "\"><?": 24669,
  "\">\\": 16452,
  "\"?": 15504,
  "\"?\"": 35261,
  "\"[": 24674,
  "\"\\": 6819,
  "\"\\\\": 39340,
  "\"]": 1894,
  "\"]'": 33789,
  "\"]')": 29986,
  "\"]').": 15572,
  "\"]');": 36452,
  "\"]',": 13016,
  "\"](": 23131,
  "\"])": 8081,
  "\"]))": 22441,
  "\"]));": 47510,
  "\"]),": 27817,
  "\"]).": 37888,
  "\"]);": 11090,
  "\"],": 2672,
  "\"],\"": 19234,
  "\"],[": 40049,
  "\"],[\"": 20456,
  "\"].": 6191,
  "\"]:": 16879,
  "\"];": 7834,
  "\"]=": 25841,
  "\"][": 15422,
  "\"][\"": 12375,
  "\"][$": 43140,
  "\"]]": 21953,
  "\"]],": 38876,
  "\"]}": 31376,
  "\"]},": 30937,
  "\"_": 41756,
  "\"`": 15724,
  "\"`,": 44143,
  "\"{": 37361,
  "\"||": 24255,
  "\"}": 3671,
  "\"})": 14693,
  "\"}),": 20336,
  "\"}).": 43005,
  "\"});": 14334,
  "\"})},": 48315,
  "\"},": 2139,
  "\"},\"": 26890,
  "\"},[": 48625,
  "\"},{": 3374,
  "\"}.": 26242,
  "\"};": 9086,
  "\"}]": 14142,
  "\"}],": 11136,
  "\"}]}": 25573,
  "\"}]},": 40619,
  "\"}]},{": 25027,
  "\"}]}],": 43830,
  "\"}}": 13774,
  "\"}},": 16898,
  "#": 121,
  "#!": 36344,
  "#\"": 37692,
  "#\",": 40651,
  "##": 1249,
  "###": 13260,
  "####": 2046,
  "#####": 27226,
  "########": 3352,
  "################": 5699,
  "################################": 10401,
  "################################################################": 22924,
  "##\\": 47104,
  "#$": 25741,
  "#%": 30790,
  "#',": 25728,
  "#.": 42227,
  "#[^\\": 15326,
  "#\\": 28289,
  "#{": 5074,
  "#{@": 33398,
  "$": 122,
  "$\"": 39196,
  "$\",": 10967,
  "$$": 14725,
  "$$$$": 40151,
  "$',": 28359,
  "$(": 9878,
  "$(\"": 37708,
  "$(\"#": 21402,
  "$(\".": 32387,
  "$('": 39732,
  "$('#": 17116,
  "$('.": 35640,
  "$)": 48582,
  "$)/,": 15587,
  "$)/,\"\"": 24036,
  "$,": 31714,
  "$.": 6704,
  "$/": 4626,
  "$/',": 21122,
  "$/,": 12538,
  "$/,\"": 27729,
  "$/.": 15070,
  "$\\": 32654,
  "$_": 7737,
  "${": 4363,
  "%": 123,
  "%\"": 22851,
  "%\",": 20633,
  "%#": 41275,
  "%%": 7464,
  "%%%%": 16865,
  "%%%%%%%%": 28142,
  "%%%%%%%%%%%%%%%%": 48942,
  "%&": 35116,
  "%'": 28729,
  "%',": 24501,
  "%(": 18223,
  "%,": 28441,
  "%-": 48638,
  "%.": 23155,
  "%;": 19062,
  "%=": 13710,
  "%\\": 35620,
  "&": 124,
  "&#": 6134,
  "&#[": 42359,
  "&&": 1500,
  "&&!": 9247,
  "&&\"": 13277,
  "&&(": 3733,
  "&')": 45564,
  "&(": 27293,
  "&)": 23558,
  "&,": 36496,
  "&[": 40725,
  "'": 125,
  "'\"": 9279,
  "'\")": 27659,
  "'\");": 16022,
  "'\",": 6514,
  "'\";": 22330,
  "'#": 49675,
  "'%": 26237,
  "'%(": 41934,
  "'&": 33626,
  "''": 7048,
  "'''": 16603,
  "'',": 42860,
  "'(": 28966,
  "')": 784,
  "')\");": 34543,
  "')\",": 32462,
  "')\";": 49619,
  "')(": 21387,
  "'))": 2256,
  "')))": 13055,
  "')));": 12326,
  "')),": 11827,
  "'))->": 36020,
  "')).": 10065,
  "')):": 30344,
  "'));": 2929,
  "')){": 30318,
  "'),": 1623,
  "'),('": 16936,
  "')->": 4349,
  "')->__('": 21462,
  "').": 2364,
  "').'": 29167,
  "'):": 2888,
  "');": 970,
  "');\\": 27638,
  "')[": 10769,
  "')]": 18507,
  "')])": 8244,
  "')],": 10563,
  "'){": 15734,
  "')}": 44490,
  "'*": 41235,
  "'+": 6498,
  "',": 534,
  "',$": 11144,
  "','": 2538,
  "',\\": 16935,
  "'-": 32738,
  "'-'": 27390,
  "'.": 2643,
  "'.\",": 40115,
  "'.\"\\": 20134,
  "'.$": 5903,
  "'/": 14243,
  "'/>": 32528,
  "':": 1188,
  "':'": 10363,
  "':\\": 37124,
  "';": 1177,
  "';\\": 23676,
  "'<": 12175,
  "'</": 20846,
  "'=>": 5648,
  "'=>$": 13135,
  "'=>'": 10100,
  "'>": 9238,
  "'>\"": 31985,
  "'><": 30951,
  "'></": 27672,
  "'>\\": 49504,
  "'?": 31219,
  "'[": 19874,
  "'\\": 6941,
  "'\\\\": 36732,
  "']": 707,
  "']\").": 48893,
  "']\",": 43355,
  "'](": 21771,
  "'](?:(?:\\\\\\\\.)|(?:[^'\\\\\\\\]))*?[": 44664,
  "'](?:(?:\\\\\\\\.)|(?:[^'\\\\\\\\]))*?[']": 48116,
  "'])": 2710,
  "']))": 3975,
  "'])))": 43499,
  "']));": 14707,
  "'])){": 36584,
  "']),": 11947,
  "'])->": 37465,
  "']).": 24839,
  "']):": 30385,
  "']);": 3290,
  "'])?$": 42786,
  "']){": 45890,
  "']++;": 24043,
  "'],": 2018,
  "'],$": 35926,
  "']->": 12066,
  "'].": 5955,
  "'].\"": 31886,
  "'].$": 47365,
  "'].'": 19804,
  "']/": 38427,
  "']:": 10692,
  "'];": 3024,
  "']=": 25019,
  "']=$": 34423,
  "'][": 7148,
  "'][$": 8528,
  "']['": 3329,
  "']['']['": 45094,
  "'][]": 17051,
  "']]": 13720,
  "']])": 35756,
  "']]))": 42218,
  "']]);": 41159,
  "']],": 21181,
  "']];": 33450,
  "']]['": 31936,
  "']}": 23225,
  "'^": 36481,
  "'_": 35204,
  "'``": 47849,
  "'d": 8522,
  "'ll": 7886,
  "'m": 9652,
  "'re": 4409,
  "'s": 1424,
  "'t": 1340,
  "'ve": 9256,
  "'{": 36324,
  "'}": 11428,
  "'})": 22257,
  "'}),": 48443,
  "'});": 18538,
  "'},": 10438,
  "'},{": 38915,
  "'};": 36014,
  "'}}": 15767,
  "(": 126,
  "(!": 1969,
  "(!!": 39132,
  "(!$": 13769,
  "(!(": 12546,
  "(!_": 30721,
  "(\"": 503,
  "(\"!": 34835,
  "(\"\"": 32486,
  "(\"\"\"": 24706,
  "(\"\")": 16503,
  "(\"\"))": 31779,
  "(\"\"));": 33294,
  "(\"\"),": 23271,
  "(\"\").": 45400,
  "(\"\");": 11046,
  "(\"\",": 10055,
  "(\"#": 5778,
  "(\"#%": 36896,
  "(\"#{": 20165,
  "(\"$": 8809,
  "(\"${": 37780,
  "(\"%": 2701,
  "(\"%#": 23093,
  "(\"%.": 40191,
  "(\"&": 17505,
  "(\"'": 14786,
  "(\"'\",": 42666,
  "(\"(": 16934,
  "(\"(\"": 33762,
  "(\"(%": 33313,
  "(\")": 44058,
  "(\")\");": 41360,
  "(\");": 48719,
  "(\"*": 18131,
  "(\"**": 45567,
  "(\"***": 42008,
  "(\"+": 9444,
  "(\",": 8192,
  "(\",\"": 26652,
  "(\",\")": 36184,
  "(\",\");": 26587,
  "(\",\",": 34476,
  "(\"-": 7014,
  "(\"--": 12203,
  "(\".": 3111,
  "(\".\")": 38066,
  "(\".\");": 31962,
  "(\".\",": 38556,
  "(\"..": 45516,
  "(\"../": 5516,
  "(\"../../": 10654,
  "(\"./": 5358,
  "(\"/": 4532,
  "(\"/\")": 31009,
  "(\"/\"))": 44071,
  "(\"/\");": 36173,
  "(\"/\",": 28743,
  "(\"//": 19031,
  "(\":": 10599,
  "(\":\");": 43228,
  "(\":/": 40246,
  "(\";": 22180,
  "(\"<": 6485,
  "(\"</": 17210,
  "(\"=\"": 49077,
  "(\">": 19361,
  "(\"?": 25869,
  "(\"@": 15371,
  "(\"[": 6790,
  "(\"[%": 28499,
  "(\"\\": 3792,
  "(\"\\\"": 22184,
  "(\"\\\\": 14672,
  "(\"^": 20800,
  "(\"_": 9340,
  "(\"_\"),": 22043,
  "(\"__": 19476,
  "(\"{": 8739,
  "(\"{$": 40502,
  "(\"{\\\"": 49755,
  "(\"{}": 32638,
  "(\"|": 21621,
  "(\"}\");": 44190,
  "(\"}\\": 45608,
  "(\"~": 46969,
  "(\"~/": 34044,
  "(#": 42808,
  "($": 569,
  "($\"": 10831,
  "($\"{": 29227,
  "($(": 15722,
  "($('#": 37829,
  "($)": 30556,
  "($){": 20572,
  "($.": 10963,
  "($_": 5638,
  "(${": 11061,
  "(%": 4702,
  "(%[": 33480,
  "(&": 862,
  "(&$": 12310,
  "(&(": 15322,
  "(&(*": 35414,
  "(&:": 28427,
  "(&_": 7672,
  "('": 562,
  "('!": 39989,
  "('\"": 15986,
  "('\"')": 46864,
  "('\"',": 35156,
  "('#": 4874,
  "('$": 14239,
  "('%": 8860,
  "('&": 22493,
  "('''": 46310,
  "('')": 20041,
  "('');": 13969,
  "('',": 13391,
  "('(": 36475,
  "('('": 35820,
  "(')": 46226,
  "('*": 19582,
  "('*',": 47200,
  "('+": 23077,
  "(',": 6820,
  "(',')": 26621,
  "(',');": 30448,
  "(',',": 14876,
  "('-": 8586,
  "('-',": 30134,
  "('--": 10591,
  "('.": 3639,
  "('.$": 45277,
  "('.'": 40431,
  "('.')": 23974,
  "('.');": 15805,
  "('.',": 19955,
  "('../": 17744,
  "('../../": 40317,
  "('./": 12665,
  "('/": 3811,
  "('/')": 21579,
  "('/');": 20852,
  "('/',": 17640,
  "('//": 23730,
  "('/\\": 26236,
  "('/^": 16158,
  "('/^\\": 46315,
  "(':": 9151,
  "(':')": 34603,
  "(':');": 41414,
  "(':',": 27598,
  "('::": 45719,
  "(';": 24993,
  "('<": 6593,
  "('</": 43052,
  "('=": 25405,
  "('=');": 42892,
  "('=',": 43482,
  "('>": 24926,
  "('?": 34580,
  "('@": 19928,
  "('[": 8990,
  "('['": 36940,
  "('\\": 6492,
  "('\\\\": 14621,
  "('\\\\',": 27631,
  "('^": 32263,
  "('_": 7974,
  "('_'),": 16067,
  "('_',": 35418,
  "('__": 22971,
  "('`": 43116,
  "('{": 14418,
  "('{{": 41939,
  "('{}": 48323,
  "('|": 20215,
  "('|',": 39077,
  "('~": 34127,
  "((": 1172,
  "((!": 37570,
  "((\"": 11912,
  "((\"%": 47065,
  "(($": 17868,
  "((&": 38372,
  "(('": 27645,
  "(((": 6963,
  "((((": 37762,
  "(()": 7590,
  "((*": 8016,
  "((-": 43815,
  "((::": 34143,
  "((?": 34173,
  "((?:": 44434,
  "(([": 42274,
  "((\\": 37391,
  "((_": 34019,
  "((__": 32076,
  "()": 429,
  "()!=": 34080,
  "()\"": 24744,
  "()\");": 17234,
  "()\",": 13866,
  "()%": 46695,
  "()&&": 31702,
  "()&&(": 28335,
  "()'": 24436,
  "()');": 45033,
  "()',": 26367,
  "()(": 20950,
  "())": 979,
  "()))": 3653,
  "())))": 21477,
  "())));": 19903,
  "())),": 29916,
  "())).": 19224,
  "()));": 3560,
  "()),": 4380,
  "())->": 10356,
  "()).": 4005,
  "()):": 15639,
  "());": 930,
  "())[": 49812,
  "()){": 11198,
  "())}": 39171,
  "())})})}": 47458,
  "())},": 32617,
  "())};": 46080,
  "()*": 18090,
  "()+": 10498,
  "()+\"": 30085,
  "(),": 893,
  "(),!": 36436,
  "(),\"": 21475,
  "(),{": 32733,
  "()-": 11248,
  "()->": 1756,
  "().": 904,
  "().$": 41942,
  "().'": 47320,
  "().'/": 47881,
  "().(": 22280,
  "().(*": 18140,
  "()/": 15491,
  "():": 2077,
  "();": 523,
  "();\");": 11715,
  "();)": 34751,
  "();//": 38728,
  "();\\": 15506,
  "();}": 23934,
  "()</": 31736,
  "()<<": 48970,
  "()==": 17425,
  "()>": 24468,
  "()?": 27508,
  "()[": 6802,
  "()[\"": 44425,
  "()['": 30961,
  "()\\": 16539,
  "()]": 9024,
  "()])": 28467,
  "()]);": 23409,
  "()],": 31966,
  "()].": 38629,
  "()];": 12995,
  "()`": 21646,
  "(){": 1584,
  "(){\"": 37229,
  "(){}": 20394,
  "(){},": 31913,
  "(){};": 25962,
  "(){};(": 45966,
  "()||": 26685,
  "()||(": 35781,
  "()}": 6415,
  "()})": 29416,
  "()}),": 25585,
  "()}).": 43759,
  "()});": 28683,
  "()})}": 34072,
  "()})},": 44450,
  "()},": 9300,
  "()}.": 28077,
  "()};": 14223,
  "()}}": 27277,
  "()}},": 38443,
  "(*": 1706,
  "(*(": 17887,
  "(*)": 22548,
  "(**": 14153,
  "(+": 27765,
  "(++": 18390,
  "(,": 41169,
  "(-": 3293,
  "(--": 27215,
  "(.": 8950,
  "(.*": 23492,
  "(.*)": 21852,
  "(.*?)": 36871,
  "(.+": 41043,
  "(.+?": 48021,
  "(...": 26760,
  "(...)": 22805,
  "(/": 2739,
  "(/%": 39703,
  "(/&": 39332,
  "(/(": 28268,
  "(/([": 48079,
  "(/(\\": 45365,
  "(/*": 15531,
  "(/,": 38100,
  "(/.*": 14824,
  "(/.*(?=": 15380,
  "(/.*(?=#[^\\": 15399,
  "(/<": 32770,
  "(/[": 27412,
  "(/[\\": 21131,
  "(/[^": 42206,
  "(/\\": 6411,
  "(/\\/": 45286,
  "(/\\|[^|": 25818,
  "(/\\|[^|]*?": 25825,
  "(/\\|[^|]*?$/,\"": 33085,
  "(/\\|[^|]*?$/,\"|\"+": 33086,
  "(/^": 9140,
  "(/^(\\": 30393,
  "(/^.*": 40588,
  "(/^[": 43283,
  "(/^\\": 14431,
  "(:": 5182,
  "(::": 33627,
  "(;": 17791,
  "(;;)": 47940,
  "(<": 15352,
  "(<<": 31468,
  "(?": 1343,
  "(?!": 16184,
  "(?!\\": 44063,
  "(?:": 1464,
  "(?:\"": 39026,
  "(?:\"+": 34119,
  "(?:(?:": 27747,
  "(?:(?:\\\\": 21970,
  "(?:(?:\\\\.\\\\": 46841,
  "(?:(?:\\\\\\\\.": 23682,
  "(?:(?:\\\\\\\\.)|(?:[^": 23977,
  "(?:(?:\\\\\\\\.)|(?:[^\"": 37617,
  "(?:(?:\\\\\\\\.)|(?:[^\"\\\\\\\\]))*?": 42917,
  "(?:(?:\\\\\\\\.)|(?:[^'": 37307,
  "(?:(?:\\\\\\\\.)|(?:[^'\\\\\\\\]))*?": 37446,
  "(?:(?:\\\\\\\\.)|(?:[^'\\\\\\\\]))*?[": 42644,
  "(?:[": 12549,
  "(?:[^": 45760,
  "(?:\\": 15235,
  "(?:\\.\\": 39180,
  "(?:\\\\": 14127,
  "(?<": 25687,
  "(?=": 8929,
  "(?=.": 36083,
  "(?=[": 32052,
  "(?=\\": 27453,
  "(?=\\()/": 43172,
  "(?=\\\\": 23321,
  "(?>": 46081,
  "(@": 4977,
  "(@\"": 13822,
  "([": 1896,
  "([\"": 7605,
  "([\"../../": 25655,
  "([$": 22962,
  "([&": 41792,
  "(['": 5462,
  "([(": 35593,
  "([-": 23330,
  "([[": 14072,
  "([\\": 15020,
  "([]": 3664,
  "([])": 14599,
  "([]),": 43997,
  "([]);": 28630,
  "([]*": 21669,
  "([],": 16756,
  "([^": 12305,
  "([^\"]": 46596,
  "([^\\": 22700,
  "([{": 39098,
  "(\\": 3617,
  "(\\\"": 13597,
  "(\\$": 29155,
  "(\\'": 23311,
  "(\\.": 36543,
  "(\\\\": 10307,
  "(\\\\.": 33423,
  "(\\{": 42356,
  "(\\{|\\[": 45121,
  "(\\{|\\[)[^\\}\\]]": 45145,
  "(\\{|\\[)[^\\}\\]]*$|^\\": 45146,
  "(_": 1599,
  "(_(\"": 18288,
  "(_,": 35534,
  "(_.": 18692,
  "(__": 4122,
  "(__('": 30485,
  "(`": 8401,
  "({": 1820,
  "({\"": 14318,
  "({$": 41407,
  "({'": 15154,
  "({_": 44045,
  "({})": 41510,
  "({});": 35536,
  "({},": 6973,
  "(~": 25188,
  ")": 127,
  ")!=": 21003,
  ")\"": 6120,
  ")\")": 14661,
  ")\"));": 35947,
  ")\"),": 18449,
  ")\").": 40180,
  ")\");": 8507,
  ")\",": 4188,
  ")\":": 33117,
  ")\";": 10921,
  ")\"},{": 30012,
  ")#": 32988,
  ")$": 7424,
  ")$/": 25552,
  ")%": 17256,
  ")&": 9902,
  ")&&": 10575,
  ")&&!": 26262,
  ")&&(": 12859,
  ")'": 10004,
  ")')": 17728,
  ")'),": 30407,
  ")').": 31787,
  ")');": 17958,
  ")',": 7496,
  ")';": 26537,
  ")(": 1945,
  ")(\"": 24456,
  ")(\"+": 27993,
  ")($": 44634,
  ")(&": 33889,
  ")('": 47012,
  ")((": 9081,
  ")(((": 17389,
  ")()": 44277,
  ")();": 34232,
  ")(*": 34013,
  ")(?:": 36325,
  ")(\\": 25337,
  ")(\\\\": 10266,
  ")(\\\\.": 40851,
  ")(_": 45307,
  "))": 509,
  "))\",": 26460,
  "))(": 32245,
  ")))": 1858,
  "))))": 9716,
  ")))))": 47142,
  ")))));": 35784,
  "))))**": 47267,
  ")))),": 28008,
  "))));": 16364,
  "))),": 15109,
  "))).": 22519,
  "))):": 42466,
  ")));": 2950,
  "))){": 30763,
  ")))|": 18553,
  ")))};": 48359,
  "))*": 17722,
  "))*(": 39955,
  "))**": 47737,
  "))**(": 49453,
  "))+": 29232,
  ")),": 1543,
  ")),\"": 17194,
  "))-": 40362,
  "))->": 14699,
  ")).": 3940,
  "))/": 24123,
  ")):": 6800,
  ")):(": 44785,
  "));": 648,
  "));\\": 31704,
  "));}": 32164,
  "))?": 18972,
  "))[": 24494,
  "))\\": 32469,
  "))]": 10920,
  "))];": 44807,
  ")){": 5928,
  "))|": 6979,
  "))}": 14278,
  "))},": 15716,
  "))};": 29705,
  ")*": 4170,
  ")*(": 13244,
  ")**": 20756,
  ")*/": 49044,
  ")+": 6239,
  ")+\"": 17319,
  ")+'": 25656,
  ")+(": 32508,
  ")++;": 28051,
  "),": 556,
  "),!": 24598,
  "),\"": 15753,
  "),$": 41177,
  "),'": 47987,
  "),(": 20746,
  "),\\": 37464,
  ")-": 6060,
  ")->": 2528,
  ").": 673,
  ").\"": 27439,
  ").\",": 30565,
  ").$": 41108,
  ").'": 15955,
  ").')": 40504,
  ").(": 32976,
  ").(*": 49949,
  ").*\\*\\/\\": 31602,
  ")...": 40247,
  ")...)": 33246,
  ").</": 20085,
  ").\\": 21555,
  ")._": 44598,
  ").__": 40595,
  ")/": 3747,
  ")/\",": 49821,
  ")/(": 19490,
  ")/,": 10646,
  ")/.": 21689,
  ")//": 35184,
  ")/;": 48305,
  "):": 953,
  "):!": 40481,
  "):\"": 23424,
  "):(": 23011,
  ")::": 46464,
  "):\\": 31583,
  "):]": 34056,
  ");": 388,
  ");\"": 37936,
  ");\");": 35245,
  ");\",": 29931,
  ");$": 47360,
  ");*/": 35621,
  ");//": 18531,
  ");\\": 5553,
  ");}": 12355,
  ");}.": 25931,
  ");};": 49314,
  ");}}": 45213,
  ")<": 21245,
  ")</": 13765,
  ")<<": 15797,
  ")=": 24571,
  ")==": 12556,
  ")==\"": 41819,
  ")===": 29023,
  ")>": 14797,
  ")>=": 47427,
  ")>>": 22456,
  ")?": 2890,
  ")?\"": 22826,
  ")?(": 31751,
  ")?))|": 23993,
  ")?)?)|": 40334,
  ")?)|": 11534,
  ")?.": 43736,
  ")?/\",": 30142,
  ")?\\": 37916,
  ")?\\\\": 34704,
  ")?|": 6521,
  ")[": 4191,
  ")[\"": 46042,
  ")['": 35283,
  ")[:": 41374,
  ")[^\\": 40648,
  ")[^\\}\\]]": 45144,
  ")\\": 3520,
  ")\\\\": 10681,
  ")]": 2785,
  ")])": 13232,
  ")]))": 46102,
  ")]),": 46495,
  ")]);": 23183,
  ")],": 12774,
  ")].": 25329,
  ")];": 10596,
  ")]=": 45092,
  ")][": 43924,
  ")]],": 8273,
  ")^": 25923,
  ")_": 15567,
  ")__": 44881,
  ")`": 22367,
  ")`,": 35421,
  ")`.": 39060,
  ")``": 28129,
  "){": 948,
  "){\"": 6379,
  "){$": 46919,
  "){\\": 48788,
  "){}": 21339,
  ")|": 2294,
  ")|(": 20668,
  ")|(?:": 15717,
  ")|(?:[^": 23895,
  ")|\\": 41178,
  ")||": 14892,
  ")||(": 27544,
  ")}": 2973,
  ")}\"": 48984,
  ")})": 15857,
  ")}),": 17315,
  ")}).": 33758,
  ")});": 17283,
  ")})}": 19887,
  ")})},": 28880,
  ")},": 5137,
  ")}.": 19510,
  ")}:": 49928,
  ")};": 10359,
  ")}}": 9198,
  ")}},": 18624,
  ")}}.": 40779,
  ")}};": 45962,
  ")}}}": 39261,
  "*": 128,
  "*\"": 29253,
  "*\",": 14050,
  "*#": 47214,
  "*$": 16177,
  "*$/": 17845,
  "*$/);": 32541,
  "*$/,": 29633,
  "*$|^\\": 38577,
  "*&": 40726,
  "*'": 26976,
  "*')": 33905,
  "*',": 15741,
  "*(": 5378,
  "*((": 22144,
  "*(?:": 24439,
  "*(?:\\/\\": 49642,
  "*(?=\\\\": 49964,
  "*([": 29321,
  "*(\\": 14596,
  "*(\\/\\": 19167,
  "*(\\/\\*": 49094,
  "*(\\/\\*)": 38660,
  "*(\\/\\*).*\\*\\/\\": 49673,
  "*(\\/\\*\\*\\*": 49669,
  "*(\\/\\*\\*\\*).*\\*\\/\\": 49674,
  "*(\\/\\*|\\/\\/)#": 49668,
  "*)": 2484,
  "*)\"": 41453,
  "*)\",": 44686,
  "*)&": 11540,
  "*)(": 7929,
  "*)(=": 25328,
  "*)(=)(\\\\": 29685,
  "*)(\\\\": 19133,
  "*)(\\\\()\",": 20621,
  "*)?": 18864,
  "*)?(?:[": 32055,
  "*)\\": 40717,
  "*)_": 47184,
  "**": 468,
  "**(": 30686,
  "**)": 20109,
  "**)&": 39199,
  "***": 12163,
  "****": 568,
  "*****": 15141,
  "******": 4838,
  "*******": 16110,
  "********": 768,
  "****************": 1148,
  "************************": 12615,
  "********************************": 2036,
  "****************************************": 34994,
  "************************************************": 35252,
  "********************************************************": 42138,
  "****************************************************************": 4418,
  "************************************************************************": 5483,
  "*******************************************************************************/": 47444,
  "******************************************************************************/": 47402,
  "*******/": 20406,
  "******/": 6512,
  "*****/": 15436,
  "****/": 14626,
  "***/": 21433,
  "**/": 18185,
  "*,": 11364,
  "*,\\": 31005,
  "*-": 34893,
  "*.": 13248,
  "*/": 1898,
  "*/)": 15328,
  "*/);": 22752,
  "*/)[": 40850,
  "*/,": 12952,
  "*:": 34285,
  "*=": 19109,
  "*=*=": 43807,
  "*=\\": 48056,
  "*>": 9744,
  "*>(": 7160,
  "*>(&": 39707,
  "*>,": 31451,
  "*>::": 27184,
  "*?": 17094,
  "*[": 26344,
  "*\\": 7500,
  "*\\*": 21701,
  "*\\*\\*": 46686,
  "*\\*\\/\\": 31588,
  "*\\/": 31209,
  "*\\\\": 13270,
  "*\\\\/\",": 23453,
  "*\\})/);": 42092,
  "*\\}/.": 41929,
  "*]": 39031,
  "*_": 31805,
  "*|\\": 23406,
  "*|\\/\\/": 31578,
  "*|\\/\\/)#": 45082,
  "*}": 33879,
  "+": 129,
  "+\"": 3191,
  "+\"'": 43278,
  "+\")": 9745,
  "+\")\",": 39596,
  "+\")(\"+": 44139,
  "+\")(\\\\": 25360,
  "+\")(\\\\.": 38755,
  "+\")(\\\\.)(\"+": 48422,
  "+\",": 20158,
  "+\"-": 33939,
  "+\".": 16045,
  "+\"/": 15246,
  "+\"/\"+": 43230,
  "+\":": 33784,
  "+\"</": 25713,
  "+\"\\": 21623,
  "+\"\\\\": 45415,
  "+\"]": 41867,
  "+\"_": 32868,
  "+\"},{": 31227,
  "+\"}],": 29743,
  "+#": 45690,
  "+$": 23909,
  "+$/": 33424,
  "+$/.": 36100,
  "+%": 38276,
  "+'": 5476,
  "+'\"": 20750,
  "+')": 40054,
  "+',": 29348,
  "+'.": 28888,
  "+'/": 33800,
  "+'</": 38166,
  "+'[": 45203,
  "+'_": 44816,
  "+(": 11086,
  "+(?:": 40727,
  "+(?:(?:\\\\.\\\\": 49735,
  "+(\\": 40842,
  "+)": 12943,
  "+)(\\\\": 35363,
  "+)/": 30888,
  "+)?": 16670,
  "+)\\": 23719,
  "+*": 26097,
  "++": 818,
  "++$": 34321,
  "++)": 1232,
  "++));": 41573,
  "++);": 11847,
  "++){": 7050,
  "+++": 34341,
  "++++": 14282,
  "++++++++": 23793,
  "++++++++++++++++": 41333,
  "++,": 7690,
  "++:": 42794,
  "++;": 1823,
  "++]": 5692,
  "++]);": 30956,
  "++],": 39588,
  "++].": 42577,
  "++];": 13117,
  "++]=": 46893,
  "+,": 28680,
  "+-": 7861,
  "+-+-": 10727,
  "+-+-+-+-": 17105,
  "+-+-+-+-+-+-+-+-": 28861,
  "+---------------------------------------------------------------------*/": 36609,
  "+------------------------------------------------------------------------": 37065,
  "+-]?": 18536,
  "+-]?\\": 34840,
  "+-]?\\\\": 27833,
  "+.": 21983,
  "+/": 10415,
  "+/,": 42158,
  "+=": 5327,
  "+=\"": 14154,
  "+=(": 46575,
  "+?": 23663,
  "+\\": 10383,
  "+\\-": 32623,
  "+\\\\": 30637,
  "+]": 30109,
  "+_": 47114,
  "+|": 46218,
  "+|\\": 26310,
  ",": 130,
  ",!": 12923,
  ",\"": 2088,
  ",\"\"": 31618,
  ",\"\");": 39546,
  ",\"\",": 23331,
  ",\"$": 46175,
  ",\"%": 15331,
  ",\"%\":": 24883,
  ",\"&": 44622,
  ",\",": 22833,
  ",\"-": 29124,
  ",\"[": 41210,
  ",\"\\": 12117,
  ",\"__": 38032,
  ",#": 48639,
  ",$": 4933,
  ",%": 10043,
  ",&": 9460,
  ",'": 5994,
  ",(": 11652,
  ",)": 15452,
  ",))": 22083,
  ",),": 23804,
  ",*": 20757,
  ",,": 18571,
  ",-": 4420,
  ",.": 12288,
  ",//": 19534,
  ",:": 44167,
  ",;": 45577,
  ",?\\": 44918,
  ",[": 18861,
  ",\\": 6472,
  ",\\\"": 12645,
  ",_": 8849,
  ",__": 38338,
  ",{": 7761,
  "-": 131,
  "-\"": 17678,
  "-\")": 47476,
  "-\"+": 20149,
  "-\",": 15405,
  "-\",\"": 41884,
  "-\":": 35500,
  "-$": 22399,
  "-%": 8601,
  "-'": 11705,
  "-')": 48472,
  "-',": 39152,
  "-(": 15269,
  "-)": 36573,
  "-*": 16819,
  "-*-*": 23962,
  "-*-*-*-*": 40723,
  "-*/": 33273,
  "-+": 30248,
  "--": 415,
  "--)": 7060,
  "--){": 36692,
  "--*/": 22678,
  "--+": 29129,
  "--+--+": 45834,
  "--,": 26944,
  "---": 6291,
  "---*/": 24540,
  "---+": 26738,
  "---+---+": 39339,
  "----": 478,
  "----*/": 30640,
  "----+": 27701,
  "-----": 3847,
  "-----*/": 28302,
  "-----+": 34859,
  "------": 3909,
  "------+": 36354,
  "-------": 6248,
  "-------+": 36303,
  "--------": 580,
  "----------": 49870,
  "----------------": 820,
  "------------------------": 6924,
  "-------------------------": 43876,
  "---------------------------": 43591,
  "------------------------------": 35790,
  "--------------------------------": 1326,
  "-------------------------------------": 44908,
  "----------------------------------------": 17934,
  "------------------------------------------------": 12525,
  "-------------------------------------------------": 24477,
  "--------------------------------------------------------": 10552,
  "----------------------------------------------------------": 45099,
  "----------------------------------------------------------------": 2949,
  "---------------------------------------------------------------------*/": 35053,
  "----------------------------------------------------------------------": 13287,
  "-----------------------------------------------------------------------": 31888,
  "------------------------------------------------------------------------": 4536,
  "-------------------------------------------------------------------------": 46927,
  "------------------------------------------------------------------------------": 47722,
  "--------------------------------------------------------------------------------": 31930,
  "--;": 4671,
  "--;)": 29759,
  "-->": 24878,
  "--|": 28649,
  "-.": 9943,
  "-/": 42645,
  "-=": 14085,
  "->": 408,
  "->$": 12870,
  "->_": 1406,
  "->__": 11770,
  "->__('": 26623,
  "->{$": 19415,
  "->{'": 38883,
  "-?": 48742,
  "-\\": 4685,
  "-\\\\": 27642,
  "-]+": 15238,
  "-_": 32307,
  "-_]+": 19300,
  "-_]+\"": 41070,
  "-_]+\"},{": 26716,
  "-{": 35992,
  "-|": 48140,
  ".": 132,
  ".\"": 3508,
  ".\"\"\"": 6315,
  ".\"'": 48486,
  ".\")": 7824,
  ".\"))": 43560,
  ".\"));": 20259,
  ".\"),": 18735,
  ".\");": 3471,
  ".\")]": 32559,
  ".\"+": 24981,
  ".\",": 3041,
  ".\",\"": 14313,
  ".\".": 28997,
  ".\";": 13026,
  ".\"\\": 29849,
  ".\"},": 40760,
  ".$": 1303,
  ".$$": 23064,
  ".$(": 31392,
  ".$.": 21557,
  ".%": 8348,
  ".'": 3088,
  ".'\"": 24754,
  ".'''": 43873,
  ".')": 9167,
  ".'));": 23797,
  ".'),": 29644,
  ".');": 6626,
  ".',": 6533,
  ".','": 37836,
  ".'.": 16707,
  ".'/": 11970,
  ".'/'.$": 30433,
  ".':": 43594,
  ".';": 22290,
  ".'<": 48930,
  ".'</": 32156,
  ".']": 43593,
  ".'_": 38735,
  ".(": 5916,
  ".(*": 7369,
  ".([]": 39708,
  ".)": 8371,
  ".),": 38122,
  ".);": 34210,
  ".*": 3522,
  ".*$": 30473,
  ".*$/": 40883,
  ".*',": 42190,
  ".*)": 20847,
  ".*/": 25547,
  ".*?": 12756,
  ".*?)": 40907,
  ".*?)\\": 37370,
  ".*?\\\\": 37418,
  ".*\\": 30745,
  ".*]]": 10530,
  ".+": 13850,
  ".+?": 42195,
  ".,": 5545,
  ".-": 31635,
  "..": 926,
  "..)": 16109,
  "..-": 42165,
  "...": 2093,
  "...\"": 19826,
  "...\")": 21899,
  "...\");": 14785,
  "...\",": 20341,
  "...\";": 33357,
  "...'": 25602,
  "...')": 34207,
  "...');": 44813,
  "...',": 40509,
  "...)": 5277,
  "...))": 32891,
  "...),": 42315,
  "...).": 48700,
  "...,": 21648,
  "....": 3779,
  "......": 33539,
  "........": 6465,
  "................": 10833,
  "................................": 20132,
  "................................................................": 45560,
  "...</": 43774,
  "...\\": 14782,
  "...]": 28355,
  "...}\\": 41987,
  "../": 3053,
  "../../": 9382,
  "../../../": 29902,
  "../../../../": 48535,
  "..\\": 26982,
  "./": 12798,
  ".:": 33759,
  ".;": 21744,
  ".<": 11535,
  ".</": 1690,
  ".=": 22169,
  ".@": 37402,
  ".[": 26510,
  ".\\": 2921,
  ".]": 20610,
  ".])": 39861,
  ".]+": 30583,
  ".],": 28690,
  "._": 1073,
  "._.": 25906,
  ".__": 3954,
  ".`": 21422,
  ".{": 26155,
  "/": 133,
  "/\"": 9502,
  "/\")": 26831,
  "/\");": 29506,
  "/\"+": 25022,
  "/\",": 8305,
  "/\".$": 44878,
  "/\";": 29029,
  "/\">": 39534,
  "/#": 14528,
  "/#/.": 47191,
  "/#{": 35542,
  "/$": 18366,
  "/%": 6776,
  "/'": 8554,
  "/')": 25628,
  "/');": 27902,
  "/'+": 44529,
  "/',": 9221,
  "/'.": 42893,
  "/'.$": 26826,
  "/';": 32299,
  "/(": 11195,
  "/)": 21609,
  "/))": 27752,
  "/),": 22140,
  "/).": 44115,
  "/);": 13240,
  "/*": 642,
  "/*!": 8343,
  "/*\",": 29026,
  "/*################################################################": 38539,
  "/*#####################################################################": 39351,
  "/**": 2339,
  "/***": 49770,
  "/*****": 48666,
  "/************************": 34604,
  "/********************************": 18876,
  "/****************************************": 47475,
  "/************************************************": 47728,
  "/********************************************************": 42481,
  "/****************************************************************": 17603,
  "/************************************************************************": 7341,
  "/****************************************************************************": 38688,
  "/*****************************************************************************": 46977,
  "/******************************************************************************": 34051,
  "/*******************************************************************************": 26655,
  "/******************************************************************************/": 45025,
  "/*****************************************************************************/": 46408,
  "/****************************************************************************/": 31328,
  "/*************************************************************************/": 31432,
  "/************************************************************************/": 15896,
  "/******/": 7287,
  "/***/": 16028,
  "/**/*.": 35594,
  "/**\\": 21820,
  "/*++": 35686,
  "/*--------------------------------------------------------": 39514,
  "/*----------------------------------------------------------------": 43100,
  "/*----------------------------------------------------------------------": 32996,
  "/*------------------------------------------------------------------------": 18691,
  "/*.": 18819,
  "/*/": 35315,
  "/*================================================================": 41572,
  "/+": 14716,
  "/,": 5823,
  "/,\"": 49757,
  "/-": 30655,
  "/.": 7803,
  "//": 414,
  "//!": 15945,
  "//\",": 33190,
  "//#": 16658,
  "//$": 28305,
  "//*": 45087,
  "//****************************************************************": 49204,
  "//************************************************************************": 41587,
  "//,": 48513,
  "//--": 28466,
  "//----------------------------------------": 47341,
  "//-------------------------------------------------": 31110,
  "//--------------------------------------------------------": 22638,
  "//--------------------------------------------------------------": 36111,
  "//----------------------------------------------------------------": 12343,
  "//------------------------------------------------------------------------": 6582,
  "//---------------------------------------------------------------------------": 26857,
  "//----------------------------------------------------------------------------": 32023,
  "//-----------------------------------------------------------------------------": 8600,
  "//------------------------------------------------------------------------------": 23438,
  "//--------------------------------------------------------------------------------": 28869,
  "//.": 45151,
  "///": 785,
  "////": 891,
  "/////": 13451,
  "//////": 21784,
  "///////": 19532,
  "////////": 1306,
  "/////////": 27379,
  "////////////////": 2115,
  "////////////////////////": 22425,
  "////////////////////////////////": 3866,
  "////////////////////////////////////////////////": 31842,
  "////////////////////////////////////////////////////////": 38964,
  "////////////////////////////////////////////////////////////////": 8246,
  "////////////////////////////////////////////////////////////////////////": 14421,
  "//////////////////////////////////////////////////////////////////////////": 38220,
  "/////////////////////////////////////////////////////////////////////////////": 38757,
  "//////////////////////////////////////////////////////////////////////////////": 46885,
  "///////////////////////////////////////////////////////////////////////////////": 33878,
  "////////////////////////////////////////////////////////////////////////////////": 27597,
  "////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////": 38272,
  "///<": 41130,
  "//===": 20009,
  "//===----------------------------------------------------------------------": 20464,
  "//===----------------------------------------------------------------------===//": 20481,
  "//================================================": 31018,
  "//=========================================================": 37419,
  "//================================================================": 11579,
  "//==========================================================================": 22502,
  "//===========================================================================": 37977,
  "//==============================================================================": 36985,
  "//@": 43200,
  "//[": 47074,
  "//\\": 31654,
  "//{": 26597,
  "//}": 21289,
  "/:": 19212,
  "/;": 23422,
  "/<": 25227,
  "/</": 33411,
  "/=": 28031,
  "/>": 3441,
  "/><": 15127,
  "/></": 27849,
  "/?": 11958,
  "/?>\",": 37432,
  "/@": 32293,
  "/[": 26904,
  "/[^/": 41734,
  "/\\": 10629,
  "/\\/": 22806,
  "/\\\\": 13283,
  "/^": 9543,
  "/^(": 48506,
  "/^([": 39074,
  "/^\\": 27960,
  "/_": 16085,
  "/{": 6158,
  "/{$": 42605,
  "/{+": 38996,
  "/},{": 18291,
  "/~": 37499,
  "0": 134,
  "00": 465,
  "000": 1523,
  "0000": 637,
  "00000": 6700,
  "000000": 4603,
  "0000000": 8506,
  "00000000": 980,
  "000000000": 24351,
  "0000000000": 41661,
  "000000000000": 33710,
  "00000000000000": 34967,
  "000000000000000": 41471,
  "0000000000000000": 1411,
  "00000000000000000000000000000000": 2226,
  "0000000000000000000000000000000000000000000000000000000000000000": 3509,
  "00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000": 5446,
  "0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000": 8330,
  "00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000": 12666,
  "0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000": 19537,
  "00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000": 30462,
  "0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000": 48988,
  "00000001": 21839,
  "00000002": 46252,
  "0000001": 39874,
  "00000010": 43006,
  "000001": 27872,
  "00001": 28160,
  "0001": 9464,
  "0002": 13142,
  "0003": 23046,
  "0004": 23174,
  "0005": 32523,
  "0006": 38747,
  "0007": 33833,
  "0008": 30935,
  "001": 6478,
  "0010": 27824,
  "0011": 42200,
  "0012": 41422,
  "0013": 41824,
  "0015": 45839,
  "002": 13408,
  "0020": 25394,
  "003": 13210,
  "004": 18544,
  "005": 14510,
  "006": 20966,
  "007": 18673,
  "008": 20380,
  "0080": 43388,
  "009": 20837,
  "01": 1350,
  "010": 10898,
  "0100": 19023,
  "0101": 41868,
  "011": 15849,
  "012": 16738,
  "0123456789": 21949,
  "013": 20883,
  "014": 14007,
  "015": 23246,
  "016": 12784,
  "017": 19130,
  "018": 29066,
  "019": 25832,
  "02": 1373,
  "020": 18491,
  "0200": 25336,
  "020000": 44491,
  "021": 29266,
  "022": 19846,
  "023": 33476,
  "024": 31857,
  "025": 15025,
  "0254": 19103,
  "026": 38431,
  "027": 32390,
  "028": 34590,
  "029": 41591,
  "03": 2688,
  "030": 30236,
  "0300": 24709,
  "0301": 26014,
  "031": 21932,
  "032": 34738,
  "033": 14105,
  "034": 49758,
  "035": 33961,
  "036": 39468,
  "037": 27655,
  "038": 34675,
  "039": 28891,
  "04": 1489,
  "040": 18492,
  "0400": 21057,
  "041": 24934,
  "042": 23882,
  "043": 6570,
  "0430": 10773,
  "0431": 22170,
  "0432": 19847,
  "0433": 31803,
  "0434": 22132,
  "0435": 13309,
  "0438": 22198,
  "0439": 44952,
  "044": 11765,
  "0440": 12321,
  "0441": 18172,
  "0442": 16523,
  "0443": 24252,
  "0447": 47486,
  "045": 31154,
  "0456": 40614,
  "0458": 42472,
  "046": 34968,
  "047": 30887,
  "048": 29758,
  "049": 31974,
  "05": 2901,
  "050": 47244,
  "0500": 22886,
  "051": 43464,
  "052": 45202,
  "055": 36707,
  "056": 27222,
  "057": 30195,
  "059": 44268,
  "06": 1956,
  "060": 22633,
  "0600": 37272,
  "061": 38118,
  "062": 8815,
  "0621": 40380,
  "0623": 20899,
  "0625": 41793,
  "0626": 38544,
  "0627": 8306,
  "0628": 12141,
  "063": 27387,
  "0631": 10516,
  "0632": 44265,
  "0633": 14268,
  "0634": 25061,
  "0639": 30756,
  "064": 3951,
  "0641": 31690,
  "0643": 47610,
  "0644": 11560,
  "0645": 11168,
  "0646": 12153,
  "0647": 35588,
  "0648": 11192,
  "065": 32867,
  "066": 25226,
  "067": 25216,
  "068": 40078,
  "069": 43551,
  "07": 3594,
  "070": 36236,
  "0700": 41565,
  "072": 43823,
  "074": 37215,
  "077": 47592,
  "08": 2772,
  "080": 35340,
  "0800": 29244,
  "081": 48570,
  "085": 40436,
  "089": 48983,
  "09": 1965,
  "090": 14957,
  "0900": 23939,
  "091": 24204,
  "092": 14849,
  "0928": 36981,
  "093": 16382,
  "0930": 18637,
  "0935": 34560,
  "0938": 33207,
  "094": 17371,
  "0941": 35656,
  "0947": 36751,
  "095": 28713,
  "096": 11392,
  "097": 34600,
  "098": 37492,
  "099": 26472,
  "1": 135,
  "10": 1083,
  "100": 2508,
  "1000": 3880,
  "10000": 10059,
  "100000": 22703,
  "1000000": 24309,
  "10000000": 37682,
  "100000000": 38474,
  "1001": 31961,
  "1002": 43503,
  "1004": 31872,
  "101": 8410,
  "1010": 12490,
  "10101010": 26498,
  "1010101010101010": 47425,
  "1011": 44433,
  "102": 11583,
  "1023": 20574,
  "1024": 8681,
  "103": 12669,
  "104": 14365,
  "1040": 49623,
  "105": 16137,
  "106": 17260,
  "107": 15172,
  "108": 17035,
  "109": 17588,
  "11": 1290,
  "110": 10584,
  "1100": 25838,
  "1105": 34416,
  "111": 11403,
  "1111": 8961,
  "11111111": 20609,
  "1111111111111111": 41463,
  "112": 16931,
  "113": 18550,
  "114": 18246,
  "115": 19796,
  "116": 20228,
  "117": 18463,
  "118": 21321,
  "119": 20796,
  "12": 1093,
  "120": 11109,
  "1200": 21582,
  "1201": 39095,
  "121": 17735,
  "1212": 21682,
  "12121212": 40710,
  "122": 12589,
  "123": 6143,
  "1234": 5003,
  "12345": 19798,
  "123456": 7368,
  "1234567": 45623,
  "12345678": 34973,
  "123456789": 9591,
  "1234567890": 13738,
  "12345678901234567890": 22074,
  "1234567890123456789012345678901234567890": 48194,
  "124": 20201,
  "125": 12575,
  "1250": 42335,
  "1251": 28366,
  "1252": 30609,
  "126": 22243,
  "127": 8038,
  "1271": 23101,
  "1273": 48845,
  "128": 3706,
  "1280": 39463,
  "129": 19122,
  "13": 2040,
  "130": 20538,
  "1305": 25649,
  "131": 22872,
  "132": 11561,
  "133": 24849,
  "134": 14235,
  "135": 19495,
  "136": 22237,
  "1362": 20386,
  "137": 20925,
  "138": 24795,
  "139": 21071,
  "14": 2111,
  "140": 20700,
  "1400": 47840,
  "141": 24757,
  "1414": 29807,
  "142": 32419,
  "143": 24406,
  "144": 19771,
  "145": 24153,
  "146": 18339,
  "147": 14637,
  "14748": 22150,
  "14748364": 23042,
  "148": 21968,
  "149": 23327,
  "15": 1874,
  "150": 11140,
  "1500": 25724,
  "151": 31155,
  "152": 19270,
  "153": 26618,
  "154": 18369,
  "155": 28118,
  "156": 24161,
  "157": 26626,
  "158": 30171,
  "159": 22602,
  "16": 1027,
  "160": 11172,
  "1600": 45216,
  "161": 29629,
  "1616": 40900,
  "162": 31526,
  "163": 23198,
  "164": 20540,
  "165": 23348,
  "166": 20976,
  "167": 25995,
  "168": 14467,
  "169": 19774,
  "17": 2449,
  "170": 15114,
  "171": 26079,
  "1712": 35666,
  "172": 27917,
  "1724": 35734,
  "173": 27622,
  "174": 29573,
  "1746": 49395,
  "175": 27404,
  "176": 26013,
  "177": 25320,
  "178": 28280,
  "179": 23033,
  "18": 2243,
  "180": 11808,
  "1800": 32814,
  "1801": 32255,
  "181": 25471,
  "182": 30105,
  "183": 31495,
  "184": 28602,
  "185": 29338,
  "186": 28684,
  "187": 24977,
  "188": 20555,
  "189": 29226,
  "19": 2273,
  "190": 16472,
  "1900": 40468,
  "191": 23711,
  "192": 8224,
  "193": 23044,
  "194": 29351,
  "195": 26514,
  "196": 24919,
  "197": 21118,
  "1970": 24997,
  "1978": 38909,
  "198": 22377,
  "199": 14713,
  "1999": 28654,
  "2": 136,
  "20": 1696,
  "200": 3014,
  "2000": 8856,
  "20000": 30377,
  "200000": 45599,
  "2001": 16746,
  "2002": 36259,
  "2003": 28090,
  "2004": 19146,
  "2005": 23038,
  "2006": 19893,
  "2007": 14501,
  "2008": 16613,
  "2009": 25953,
  "201": 4252,
  "2010": 15484,
  "2011": 14526,
  "2012": 9264,
  "2013": 14847,
  "2014": 12138,
  "2015": 13123,
  "2016": 10075,
  "2017": 11824,
  "2018": 17787,
  "2019": 17794,
  "202": 9781,
  "2020": 41431,
  "2022": 39350,
  "2028": 34371,
  "2029": 49090,
  "203": 21725,
  "204": 12243,
  "2048": 25782,
  "205": 20392,
  "206": 21523,
  "2063": 33392,
  "207": 25063,
  "208": 23704,
  "209": 28479,
  "21": 3334,
  "210": 13804,
  "2100": 44116,
  "211": 22413,
  "212": 24366,
  "213": 19187,
  "214": 29307,
  "214748364": 31589,
  "215": 20829,
  "216": 18894,
  "217": 34945,
  "218": 22884,
  "219": 34730,
  "22": 2483,
  "220": 16766,
  "2200": 39207,
  "221": 19153,
  "222": 20329,
  "2222": 19434,
  "22222222": 42679,
  "223": 29142,
  "224": 13566,
  "225": 26415,
  "226": 30460,
  "227": 27388,
  "228": 27284,
  "229": 28316,
  "23": 2668,
  "230": 25028,
  "231": 16159,
  "232": 18580,
  "233": 29397,
  "234": 14037,
  "2341": 42982,
  "235": 25503,
  "236": 30064,
  "237": 31422,
  "238": 28848,
  "23885": 33372,
  "239": 28300,
  "24": 2050,
  "240": 18518,
  "2400": 19027,
  "241": 40661,
  "2410": 29981,
  "2412": 37615,
  "242": 26436,
  "243": 34050,
  "244": 31035,
  "245": 23907,
  "246": 28168,
  "247": 32592,
  "248": 26908,
  "249": 28760,
  "25": 1506,
  "250": 9627,
  "2500": 29192,
  "251": 29114,
  "252": 20026,
  "253": 25178,
  "254": 22318,
  "255": 5076,
  "25519": 20937,
  "256": 3528,
  "257": 24230,
  "258": 20764,
  "259": 31020,
  "26": 3202,
  "260": 32376,
  "261": 37594,
  "262": 25811,
  "263": 28207,
  "264": 12383,
  "265": 21888,
  "266": 33803,
  "267": 37273,
  "268": 39942,
  "269": 40096,
  "27": 2745,
  "270": 25893,
  "271": 29236,
  "272": 35657,
  "273": 40269,
  "274": 43149,
  "275": 36999,
  "276": 39348,
  "277": 33447,
  "278": 37081,
  "279": 36395,
  "28": 2415,
  "280": 25483,
  "2800": 38984,
  "281": 39516,
