{
  "'10340": 83169,
  "'=": 55441,
  "'D": 58619,
  "'SomeCookie": 55644,
  "'\\n": 79530,
  "'action": 80483,
  "'allowStaticMethodAccess": 74567,
  "'expression": 68159,
  "'filename.txt": 54224,
  "'foo": 70913,
  "'mkdir": 61268,
  "'n": 85546,
  "'name": 54786,
  "'origin": 59024,
  "'top": 70554,
  "'true": 67702,
  "'updated": 65280,
  "'userid": 70512,
  "'~": 70064,
  "++data": 66680,
  "++i": 56676,
  "++intEnd": 52770,
  "++pos": 80084,
  "+MAX_RECORD_SIZE": 67570,
  "+Messages.Mailer_FailedToSendEmail": 67187,
  "+Short.MIN_VALUE": 62078,
  "+Util.escape": 74745,
  "+\\\\p": 63290,
  "+affectedPath": 61489,
  "+data+": 68026,
  "+extraAttributes": 68305,
  "+length+": 80352,
  "+line": 74668,
  "+location": 67614,
  "+name": 82913,
  "+o.getClass": 54656,
  "+redirectAttribute": 55569,
  "+result": 57948,
  "+sd.fileName": 84245,
  "+setter": 70813,
  "+setter.substring": 63077,
  "+this.getClass": 56387,
  "+url": 56801,
  "+url.substring": 71742,
  "+uuid": 83136,
  "+uuid+": 84626,
  "-1": 67227,
  "-1.0f": 52383,
  "-1L": 82385,
  "-2": 65257,
  "-2.0": 76296,
  "-MAGIC.length": 83692,
  "-c": 59042,
  "-c1": 52909,
  "./CWE690_NULL_Deref_From_Return__Helper.properties": 55380,
  "./src/testcases/CWE643_Xpath": 71482,
  ".ESAPI": 86244,
  ".OFFLINE_MESSAGES_NOT_SUPPORTED": 80138,
  ".\\\\src\\\\testcases\\\\CWE379_File_Creation_in_Insecure_Dir\\\\secureDir": 74991,
  ".absoluteURI": 63063,
  ".add": 76386,
  ".addAll": 79077,
  ".addBinding": 55961,
  ".addFirst": 75602,
  ".addPath": 69948,
  ".append": 62082,
  ".asInteger": 53109,
  ".asWarningText": 57555,
  ".attach": 70454,
  ".attr": 65102,
  ".build": 66937,
  ".byDefaultProvider": 69921,
  ".caption": 80715,
  ".cause": 65632,
  ".checkName": 77882,
  ".checkPermission": 84771,
  ".clear": 79633,
  ".collect": 63997,
  ".commit": 83437,
  ".completeWrite": 69513,
  ".configure": 74463,
  ".contains": 82528,
  ".containsKey": 53927,
  ".createClient": 55516,
  ".createUser": 57820,
  ".createVolatileContact": 53002,
  ".data": 61578,
  ".describeTo": 61955,
  ".destroyDefinedIndex": 54679,
  ".destroyDefinedIndexes": 58941,
  ".doSomething": 86184,
  ".encodeForBase64": 75900,
  ".encodeForHTML": 67788,
  ".encodeURL": 78646,
  ".encoder": 56920,
  ".entrySet": 52886,
  ".equals": 75089,
  ".equalsIgnoreCase": 58581,
  ".error": 75932,
  ".esapi": 60149,
  ".evaluate": 85271,
  ".exec": 70600,
  ".execute": 55785,
  ".exit": 54542,
  ".fireMessageEvent": 84094,
  ".forEach": 56088,
  ".format": 65387,
  ".forward": 69314,
  ".freeMemory": 58715,
  ".generate": 84458,
  ".generateKey": 81010,
  ".generateResponse": 81905,
  ".get": 59327,
  ".getAbsoluteFile": 55668,
  ".getAccountById": 85156,
  ".getActionName": 70189,
  ".getActiveRsaKey": 57367,
  ".getAllowLinking": 70257,
  ".getAnsi": 61101,
  ".getAnys": 80188,
  ".getArgumentCount": 81128,
  ".getArgumentType": 71005,
  ".getAssertion": 65891,
  ".getAttribute": 74850,
  ".getAuthentication": 85314,
  ".getBanner": 54258,
  ".getBean": 75888,
  ".getBinding": 79873,
  ".getBody": 68753,
  ".getByteChunk": 85192,
  ".getBytes": 63588,
  ".getCanonicalPath": 70662,
  ".getCertificate": 74844,
  ".getCharacterEncoding": 61674,
  ".getClass": 73625,
  ".getClassLoader": 83040,
  ".getCloud": 58973,
  ".getCode": 81725,
  ".getConcreteName": 62898,
  ".getConnector": 61898,
  ".getConsole": 84151,
  ".getContent": 55348,
  ".getContentWritten": 75791,
  ".getContextClassLoader": 58830,
  ".getContextPath": 64450,
  ".getCorrectedMessageUID": 63167,
  ".getDeclaredField": 53789,
  ".getDefaultHeaderRow": 77946,
  ".getDeploymentConfiguration": 82963,
  ".getDigest": 59163,
  ".getDistributedMember": 54246,
  ".getDistributedSystem": 63648,
  ".getEncryptedValue": 82985,
  ".getEnvelope": 57104,
  ".getEquivalentPassword": 53685,
  ".getErrorCode": 58818,
  ".getFD": 80147,
  ".getField": 69224,
  ".getFile": 52977,
  ".getFirst": 64118,
  ".getFormAttribute": 79011,
  ".getHeader": 66100,
  ".getHost": 82392,
  ".getHostAddress": 86392,
  ".getHostName": 86381,
  ".getHttpHost": 84530,
  ".getHttpOutput": 79396,
  ".getId": 84520,
  ".getInputStream": 68772,
  ".getInt": 80064,
  ".getKey": 54443,
  ".getLeafProperty": 76034,
  ".getLoader": 70122,
  ".getLocalPart": 68876,
  ".getLocation": 59096,
  ".getMessageContext": 75267,
  ".getMethod": 53639,
  ".getMimeType": 55753,
  ".getName": 82378,
  ".getNamespace": 79046,
  ".getNodesObject": 82245,
  ".getObject": 51494,
  ".getOnResource": 68074,
  ".getOnSyncope": 66391,
  ".getOperation": 66514,
  ".getOperationSet": 57343,
  ".getOperations": 83639,
  ".getOutput": 51927,
  ".getPageManager": 58957,
  ".getParameters": 54059,
  ".getPassphrase": 67656,
  ".getPath": 84784,
  ".getPathToServlet": 67880,
  ".getProjectNamingStrategy": 63245,
  ".getPropertyDescriptors": 75157,
  ".getPropertySources": 65489,
  ".getPushSession": 52594,
  ".getQueryString": 82923,
  ".getRequest": 63035,
  ".getRequestUri": 80424,
  ".getResourceAsStream": 62924,
  ".getResourceFromJid": 70375,
  ".getResources": 64461,
  ".getResponse": 76773,
  ".getRootDir": 67116,
  ".getRootUrl": 69486,
  ".getSAML2ObjectFromStream": 73313,
  ".getSecurityMode": 74807,
  ".getServers": 54716,
  ".getService": 77277,
  ".getSimpleName": 77404,
  ".getSocket": 80702,
  ".getStamp": 71492,
  ".getStatusCode": 70246,
  ".getStatusMessage": 65266,
  ".getString": 56062,
  ".getT": 70379,
  ".getToken": 83629,
  ".getUriCompliance": 72178,
  ".getUserById": 69646,
  ".getUserLoginFailure": 51445,
  ".getUserName": 66410,
  ".getValue": 53504,
  ".getValueAttribute": 61265,
  ".getValueStack": 64351,
  ".getView": 75728,
  ".getWorkDir": 70924,
  ".getWriter": 76544,
  ".gz": 56543,
  ".hasFault": 80692,
  ".hideSQLErrors": 56836,
  ".in": 67383,
  ".indexOf": 56924,
  ".initCause": 68521,
  ".invalidate": 85270,
  ".isActive": 51952,
  ".isAttached": 68234,
  ".isEmpty": 67814,
  ".isEnableSignatureConfirmation": 84211,
  ".isIoAllowed": 82695,
  ".isMonitoringDisabled": 80508,
  ".isNewStreamAllowed": 86454,
  ".isOneWay": 59508,
  ".isSuccess": 69350,
  ".isTransient": 73868,
  ".isXsrfProtectionEnabled": 64891,
  ".iterator": 82760,
  ".jar": 58304,
  ".keySet": 84295,
  ".lastResult": 62496,
  ".length": 63337,
  ".loadClass": 56621,
  ".loadTrustMaterial": 83760,
  ".local": 57307,
  ".log": 57934,
  ".makeSearchIndex": 81364,
  ".manager.authenticate": 83017,
  ".matcher": 60456,
  ".matches": 53453,
  ".messageInterpolator": 65853,
  ".method": 63586,
  ".mkdirs": 79287,
  ".name": 82207,
  ".newDocumentBuilder": 56614,
  ".newInstance": 63927,
  ".newTransformer": 51880,
  ".newXPath": 57071,
  ".next": 82505,
  ".nextBytes": 72542,
  ".nextDouble": 68729,
  ".nextFloat": 65085,
  ".nextGaussian": 76481,
  ".nextInt": 77919,
  ".nextLong": 66244,
  ".normalize": 74387,
  ".onFail": 71587,
  ".openConnection": 59716,
  ".openStream": 69855,
  ".parse": 56751,
  ".parseInt": 59156,
  ".path": 51912,
  ".pem": 79120,
  ".pluginManager.uberClassLoader.loadClass": 56328,
  ".port": 60223,
  ".print": 67519,
  ".printErrorText": 52600,
  ".printf": 75228,
  ".println": 64524,
  ".process": 68135,
  ".put": 78038,
  ".putValue": 80413,
  ".query": 64915,
  ".read": 80360,
  ".rebuildDependencyGraphAsync": 73334,
  ".register": 73215,
  ".reopen": 60153,
  ".replace": 74388,
  ".replaceAll": 85334,
  ".replaceNode": 83211,
  ".representation": 85955,
  ".request": 72050,
  ".resourcePath": 71588,
  ".restoreParserState": 65952,
  ".roles": 68607,
  ".run": 58792,
  ".save": 64100,
  ".sendGetRequest": 52745,
  ".servletContext.getResource": 55900,
  ".set": 57363,
  ".setAttribute": 78146,
  ".setAuthentication": 78796,
  ".setBytes": 64541,
  ".setCid": 59498,
  ".setContextClassLoader": 69630,
  ".setGlobalContext": 75200,
  ".setHostnameVerifier": 56996,
  ".setPath": 77876,
  ".setProxy": 70451,
  ".setSslcontext": 54393,
  ".setString": 54346,
  ".setText": 74404,
  ".settings": 73303,
  ".size": 83872,
  ".split": 72510,
  ".startsWith": 74725,
  ".storeParserState": 57344,
  ".stream": 65318,
  ".substring": 71018,
  ".success": 66480,
  ".tar.gz": 56250,
  ".tgz": 73658,
  ".tmp": 67549,
  ".to": 53027,
  ".toCharArray": 78577,
  ".toDate": 84466,
  ".toFile": 65104,
  ".toInstance": 74246,
  ".toLowerCase": 71406,
  ".toPath": 64301,
  ".toProvider": 79749,
  ".toString": 81518,
  ".toURI": 54810,
  ".toURL": 62385,
  ".toUpperCase": 77317,
  ".touch": 53488,
  ".touchPage": 77840,
  ".trim": 78286,
  ".unlock": 74343,
  ".unmarshal": 51954,
  ".valueOf": 69863,
  ".values": 84546,
  ".write": 76559,
  ".zip": 68662,
  "/./": 69598,
  "//123.123.123.123:80": 80568,
  "//apache.org/xml/features/disallow-doctype-decl": 73088,
  "//apache.org/xml/features/nonvalidating/load-external-dtd": 79340,
  "//cxf.apache.org/jaxws/provider": 62879,
  "//hostname.com/j_security_check": 78888,
  "//jabber.org/protocol/muc": 76467,
  "//jabber.org/protocol/xhtml-im": 73621,
  "//localhost:389": 76205,
  "//tada.github.io/pljava/": 71381,
  "//users/user": 69058,
  "//www.example.org/": 67934,
  "//www.jenkins.io/redirect/security-144/": 64742,
  "//xml.apache.org/xslt": 70499,
  "//xml.org/sax/features/external-general-entities": 69749,
  "//xml.org/sax/features/external-parameter-entities": 73237,
  "/Employees/Employee": 78056,
  "/Test.txt": 66011,
  "/WEB-INF/": 78713,
  "/a": 52750,
  "/author.jsp": 73411,
  "/bin/ls": 59933,
  "/body": 54007,
  "/c": 59694,
  "/check_token": 70384,
  "/common/config.properties": 59226,
  "/configure": 80812,
  "/form": 83116,
  "/git-receive-pack": 66119,
  "/git-upload-pack": 51580,
  "/h2": 51861,
  "/head": 60398,
  "/home/user/doesntexistandneverwill.txt": 85563,
  "/home/user/libs/": 67689,
  "/home/user/lvl_1/lvl_2/lvl_3/": 84069,
  "/home/user/testcases/CWE379_File_Creation_in_Insecure_Dir/secureDir/": 78224,
  "/home/user/testcases/insecureDir/": 78506,
  "/home/user/uploads/": 63773,
  "/html": 59141,
  "/info/refs": 77316,
  "/javascript": 52272,
  "/location": 85604,
  "/manage": 82119,
  "/nodes": 66638,
  "/oauth/authorize": 85443,
  "/oauth/token": 57376,
  "/p": 62905,
  "/pre": 75751,
  "/screen.jpg": 82180,
  "/secret/text": 77517,
  "/service": 81497,
  "/session": 81021,
  "/settings": 69442,
  "/settings/servers": 66381,
  "/span": 65211,
  "/table": 82521,
  "/td": 79158,
  "/test": 62160,
  "/test\\": 53033,
  "/title": 75565,
  "/tmp/PWNAGE": 60959,
  "/token_keys": 79538,
  "/tr": 56377,
  "/userinfo": 69277,
  "0,1": 74848,
  "0-4": 81759,
  "0-5": 81267,
  "0-9": 60382,
  "0-9a-f": 59200,
  "0.000001": 55457,
  "0.0f": 71474,
  "0297b5eb43e3b81f9c737b353c3ade45": 62193,
  "0L": 56093,
  "0x01": 57770,
  "0x02": 70897,
  "0x03": 83751,
  "0x04": 56469,
  "0x05": 75091,
  "0x10FFFF": 60048,
  "0x3FF": 72349,
  "0x74": 69050,
  "0x7F": 70687,
  "0x80": 83952,
  "0x8F": 76200,
  "0xA": 79509,
  "0xA000": 55912,
  "0xC0": 71942,
  "0xD7C0": 71580,
  "0xD800": 56518,
  "0xDC00": 53977,
  "0xDFFF": 60740,
  "0xFF": 84678,
  "0xFF00": 74495,
  "0xff": 64530,
  "0xffff": 67919,
  "1+Byte.MAX_VALUE-Byte.MIN_VALUE": 65541,
  "1+Short.MAX_VALUE-Short.MIN_VALUE": 71914,
  "1-9": 53491,
  "100,100": 85933,
  "100-continue": 54818,
  "100.0": 55810,
  "100/": 64824,
  "10000L": 55597,
  "1000L": 80710,
  "10340": 80337,
  "10485760": 61844,
  "107.20.175.135:7001": 75837,
  "10:41:00": 66826,
  "10L": 67898,
  "10\\": 69294,
  "1337": 51579,
  "15000": 65050,
  "15001": 54967,
  "192.168.105.23": 60843,
  "192.168.30.123": 65457,
  "1e-50": 80186,
  "1e20f": 53263,
  "2.0f": 72783,
  "2010-07-13": 61345,
  "2X": 61594,
  "39543": 71323,
  "39544": 64692,
  "3A": 73195,
  "3C": 86427,
  "3E": 69616,
  "42710": 55449,
  "465": 80741,
  "5==5": 77315,
  "5L": 71166,
  "60000": 80015,
  "60L": 66349,
  "64536": 59660,
  "7e5tc4s3": 72334,
  ":\\\\d+": 82625,
  ":onFailure": 77093,
  ":registerFunction": 57226,
  "=0": 66662,
  "=5": 68153,
  "==0": 68461,
  "=\\\\-": 63910,
  "=\\\\-\\\\/": 71637,
  "=new": 54486,
  "=null": 61702,
  "=this": 83943,
  "ABCDEFG123456": 72938,
  "ABCDEFGHABCDEFGH": 79497,
  "ACL.SYSTEM": 81334,
  "ACL.impersonate": 77729,
  "ACTION_ATTRIBUTE": 68177,
  "AES/CBC/PKCS5Padding": 65427,
  "AES/CCM/NoPadding": 64659,
  "AES/ECB/PKCS5Padding": 74458,
  "AES/GCM/NOPADDING": 82005,
  "ALLOWED_METHODS.contains": 70736,
  "ALLOW_FOLDER_TRAVERSAL_OUTSIDE_WORKSPACE": 51800,
  "ASTERISK": 52345,
  "AWTException": 78108,
  "A_HREF_PART_SESSIONS": 52161,
  "Abruptly": 65929,
  "AbstractApplicationContext": 60749,
  "AbstractBitbucketEndpoint": 83335,
  "AbstractBrokerFactory": 52499,
  "AbstractBuild": 84614,
  "AbstractPointcutAdvisor": 76617,
  "AbstractUaaEvent.class": 75997,
  "Accept-Ranges": 83504,
  "AccessControlList": 83863,
  "AccessControlParser.parseAcl": 78075,
  "AccessController.doPrivileged": 74963,
  "AccountConstants.AUTO_COMPLETE_GAL_RESPONSE": 80978,
  "AccountConstants.A_GAL_ACCOUNT_ID": 56570,
  "AccountConstants.A_NEED_EXP": 66418,
  "AccountConstants.A_TYPE": 54107,
  "AccountConstants.E_NAME": 75936,
  "AccountException": 69974,
  "ActionChainResult.getChainHistory": 82215,
  "ActionContext.PARAMETERS": 61428,
  "ActionContext.VALUE_STACK": 56787,
  "ActionContext.getContext": 82488,
  "ActionInvocation": 72404,
  "ActionListener": 60004,
  "ActionListener.wrap": 76972,
  "ActionMapping": 68527,
  "ActiveMQ": 62690,
  "ActiveMQConnectionMetaData.PLATFORM_DETAILS": 78858,
  "AddressException": 76520,
  "AdminTokenThreadLocal.getUser": 53018,
  "AlgorithmParameterSpec": 72097,
  "AlreadyBoundException": 84808,
  "Ambiguous.ENCODING": 69685,
  "Ambiguous.SEPARATOR": 72567,
  "AnnotationStyle": 53644,
  "AnnotationStyle.Style": 85139,
  "AnonymousAuthenticationToken": 78365,
  "AnyTypeKind": 76725,
  "AnyTypeKind.GROUP.name": 55732,
  "AnyTypeKind.USER.name": 62106,
  "AnyTypePermission.ANY": 70564,
  "AnyUtils": 67830,
  "Anys": 53877,
  "ApiTokenProperty": 83505,
  "ApiTokenProperty.class": 69829,
  "ApiTokenProperty.class.getName": 71207,
  "AppendingStringBuffer": 56963,
  "ApplicationEnvironmentPreparedEvent": 64712,
  "ApplicationEventPublisher.class": 80195,
  "ArchiveEntry": 66586,
  "ArchiveEntrySupplier": 84045,
  "ArchiveInputStream": 58004,
  "Args.notNull": 62655,
  "ArgumentCaptor.forClass": 76718,
  "ArithmeticException": 83723,
  "Arrays.asList": 80061,
  "Arrays.clone": 76318,
  "Arrays.hashCode": 81192,
  "ArtifactBindingUtils.computeArtifactBindingIdentifierString": 79669,
  "ArtifactResolveType": 59813,
  "ArtifactResponseType": 65602,
  "AsciiString": 51533,
  "AsciiString.of": 66883,
  "Assert.assertNotNull": 59281,
  "Assert.fail": 77427,
  "Assert.notNull": 82123,
  "AssertionType": 80261,
  "AssertionUtil.decryptAssertion": 77088,
  "AssertionUtil.isAssertionEncrypted": 65171,
  "AssertionUtil.isSignatureValid": 68239,
  "AssertionUtil.isSignedElement": 72736,
  "Assuming": 54332,
  "AtomicBoolean": 75560,
  "AtomicFileWriter": 85463,
  "AtomicInteger": 83915,
  "AttachmentStorageManager.class": 63723,
  "AttributeQueryType": 58783,
  "AttributeStatementType": 74327,
  "AttributeStatementType.ASTChoiceType": 74452,
  "Authenticating": 59198,
  "Authentication.AuthenticationType.API_KEY": 55314,
  "AuthenticationException": 66756,
  "AuthenticationMechanismOutcome": 85278,
  "AuthenticationMechanismOutcome.AUTHENTICATED": 57917,
  "AuthenticationMechanismOutcome.NOT_AUTHENTICATED": 57177,
  "AuthenticationMethod.KERBEROS": 83375,
  "AuthenticationMethod.TOKEN": 74596,
  "Authenticator.class": 73006,
  "AuthnRequestType": 75421,
  "AuthnStatement": 63779,
  "AuthnStatementType": 59076,
  "AutoDiscoveredJobExecutor.class": 79407,
  "BCEL_CL": 70186,
  "BODY_ACCUMULATOR_KEY": 71770,
  "BUFFER_OVERFLOW": 80776,
  "BUFFER_SIZE": 64543,
  "BUFFER_UNDERFLOW": 52167,
  "BadMessageException": 74999,
  "BannerValidator.validate": 64269,
  "Base64.decodeBase64": 86280,
  "Base64InputStream": 51573,
  "BaseObject": 76276,
  "BasicAuthenticationFilter.class": 71729,
  "BasicContentHeaderProperties": 78323,
  "BatchWorkManager.class": 53926,
  "BeanDescription": 67892,
  "BeanUtils.getPropertyDescriptor": 72173,
  "BeansException": 57111,
  "BenchmarkTest": 82975,
  "BenchmarkTest00001": 81106,
  "BenchmarkTest00005": 62420,
  "BenchmarkTest00006": 56283,
  "BenchmarkTest00018": 66034,
  "BenchmarkTest00035": 72387,
  "BenchmarkTest00036": 68401,
  "BenchmarkTest00039": 60642,
  "BenchmarkTest00044": 54741,
  "BenchmarkTest00050": 54047,
  "BenchmarkTest00053": 60052,
  "BenchmarkTest00058": 61868,
  "BenchmarkTest00069": 64613,
  "BenchmarkTest00071": 73921,
  "BenchmarkTest00088": 60669,
  "BenchmarkTest00090": 74795,
  "BenchmarkTest00094": 67215,
  "BenchmarkTest00097": 79474,
  "BenchmarkTest00098": 80317,
  "BenchmarkTest00105": 67253,
  "BenchmarkTest00114": 82143,
  "BenchmarkTest00116": 61403,
  "BenchmarkTest00123": 82411,
  "BenchmarkTest00127": 70329,
  "BenchmarkTest00129": 64771,
  "BenchmarkTest00132": 82816,
  "BenchmarkTest00142": 69525,
  "BenchmarkTest00161": 69708,
  "BenchmarkTest00177": 72425,
  "BenchmarkTest00182": 61619,
  "BenchmarkTest00191": 59058,
  "BenchmarkTest00194": 75115,
  "BenchmarkTest00199": 66215,
  "BenchmarkTest00258": 82114,
  "BenchmarkTest00265": 66577,
  "BenchmarkTest00266": 61200,
  "BenchmarkTest00269": 64581,
  "BenchmarkTest00270": 69750,
  "BenchmarkTest00271": 69287,
  "BenchmarkTest00298": 77554,
  "BenchmarkTest00309": 54572,
  "BenchmarkTest00331": 55708,
  "BenchmarkTest00334": 67551,
  "BenchmarkTest00335": 51780,
  "BenchmarkTest00337": 58576,
  "BenchmarkTest00339": 83510,
  "BenchmarkTest00351": 81923,
  "BenchmarkTest00358": 54999,
  "BenchmarkTest00359": 73948,
  "BenchmarkTest00361": 77087,
  "BenchmarkTest00372": 52221,
  "BenchmarkTest00374": 66995,
  "BenchmarkTest00385": 60272,
  "BenchmarkTest00386": 71017,
  "BenchmarkTest00394": 86003,
  "BenchmarkTest00395": 52675,
  "BenchmarkTest00405": 76170,
  "BenchmarkTest00412": 85429,
  "BenchmarkTest00413": 82714,
  "BenchmarkTest00418": 73705,
  "BenchmarkTest00422": 62536,
  "BenchmarkTest00423": 56318,
  "BenchmarkTest00432": 64738,
  "BenchmarkTest00438": 61239,
  "BenchmarkTest00443": 62465,
  "BenchmarkTest00452": 68739,
  "BenchmarkTest00458": 63524,
  "BenchmarkTest00463": 54412,
  "BenchmarkTest00486": 62495,
  "BenchmarkTest00492": 61542,
  "BenchmarkTest00494": 81666,
  "BenchmarkTest00506": 54385,
  "BenchmarkTest00522": 85360,
  "BenchmarkTest00530": 84191,
  "BenchmarkTest00531": 51897,
  "BenchmarkTest00534": 77560,
  "BenchmarkTest00545": 68404,
  "BenchmarkTest00554": 77574,
  "BenchmarkTest00557": 75696,
  "BenchmarkTest00567": 67676,
  "BenchmarkTest00568": 79500,
  "BenchmarkTest00569": 85835,
  "BenchmarkTest00570": 59446,
  "BenchmarkTest00575": 62149,
  "BenchmarkTest00578": 67329,
  "BenchmarkTest00588": 67588,
  "BenchmarkTest00592": 85187,
  "BenchmarkTest00593": 59400,
  "BenchmarkTest00596": 67374,
  "BenchmarkTest00606": 64707,
  "BenchmarkTest00610": 79274,
  "BenchmarkTest00642": 56602,
  "BenchmarkTest00647": 65916,
  "BenchmarkTest00651": 81989,
  "BenchmarkTest00653": 52352,
  "BenchmarkTest00654": 65186,
  "BenchmarkTest00658": 54503,
  "BenchmarkTest00659": 81367,
  "BenchmarkTest00667": 61912,
  "BenchmarkTest00668": 75079,
  "BenchmarkTest00671": 64781,
  "BenchmarkTest00684": 68240,
  "BenchmarkTest00685": 73960,
  "BenchmarkTest00689": 53997,
  "BenchmarkTest00694": 51512,
  "BenchmarkTest00695": 81600,
  "BenchmarkTest00696": 78025,
  "BenchmarkTest00703": 68265,
  "BenchmarkTest00711": 72585,
  "BenchmarkTest00714": 71671,
  "BenchmarkTest00719": 55399,
  "BenchmarkTest00720": 79577,
  "BenchmarkTest00731": 76913,
  "BenchmarkTest00733": 67254,
  "BenchmarkTest00735": 77579,
  "BenchmarkTest00739": 57030,
  "BenchmarkTest00741": 57095,
  "BenchmarkTest00745": 81069,
  "BenchmarkTest00767": 64546,
  "BenchmarkTest00774": 57463,
  "BenchmarkTest00778": 78347,
  "BenchmarkTest00781": 86438,
  "BenchmarkTest00787": 54432,
  "BenchmarkTest00793": 53167,
  "BenchmarkTest00795": 53195,
  "BenchmarkTest00804": 84253,
  "BenchmarkTest00813": 66124,
  "BenchmarkTest00816": 80241,
  "BenchmarkTest00820": 66422,
  "BenchmarkTest00821": 59496,
  "BenchmarkTest00824": 57143,
  "BenchmarkTest00833": 58882,
  "BenchmarkTest00834": 80661,
  "BenchmarkTest00837": 80458,
  "BenchmarkTest00840": 55236,
  "BenchmarkTest00856": 74224,
  "BenchmarkTest00868": 75072,
  "BenchmarkTest00869": 51750,
  "BenchmarkTest00872": 53826,
  "BenchmarkTest00881": 54776,
  "BenchmarkTest00885": 66881,
  "BenchmarkTest00890": 56593,
  "BenchmarkTest00896": 83062,
  "BenchmarkTest00898": 77708,
  "BenchmarkTest00902": 59092,
  "BenchmarkTest00908": 74038,
  "BenchmarkTest00915": 62425,
  "BenchmarkTest00917": 64679,
  "BenchmarkTest00918": 77403,
  "BenchmarkTest00924": 64358,
  "BenchmarkTest00926": 76633,
  "BenchmarkTest00929": 65328,
  "BenchmarkTest00932": 68491,
  "BenchmarkTest00934": 57203,
  "BenchmarkTest00936": 82372,
  "BenchmarkTest00939": 69140,
  "BenchmarkTest00956": 59751,
  "BenchmarkTest00962": 86151,
  "BenchmarkTest00964": 55101,
  "BenchmarkTest00970": 86380,
  "BenchmarkTest00972": 79763,
  "BenchmarkTest00974": 79804,
  "BenchmarkTest00976": 68815,
  "BenchmarkTest00982": 53729,
  "BenchmarkTest00985": 51979,
  "BenchmarkTest00991": 80598,
  "BenchmarkTest00995": 72729,
  "BenchmarkTest00997": 84116,
  "BenchmarkTest01002": 72117,
  "BenchmarkTest01009": 62410,
  "BenchmarkTest01010": 68385,
  "BenchmarkTest01013": 54755,
  "BenchmarkTest01017": 73975,
  "BenchmarkTest01031": 76699,
  "BenchmarkTest01032": 64633,
  "BenchmarkTest01034": 57536,
  "BenchmarkTest01041": 65347,
  "BenchmarkTest01042": 78053,
  "BenchmarkTest01045": 64549,
  "BenchmarkTest01066": 67682,
  "BenchmarkTest01072": 77482,
  "BenchmarkTest01074": 73911,
  "BenchmarkTest01085": 83445,
  "BenchmarkTest01087": 84965,
  "BenchmarkTest01090": 57044,
  "BenchmarkTest01091": 73359,
  "BenchmarkTest01094": 58257,
  "BenchmarkTest01096": 78774,
  "BenchmarkTest01148": 65181,
  "BenchmarkTest01154": 79381,
  "BenchmarkTest01163": 65365,
  "BenchmarkTest01168": 54181,
  "BenchmarkTest01186": 72719,
  "BenchmarkTest01193": 73234,
  "BenchmarkTest01197": 77320,
  "BenchmarkTest01201": 60381,
  "BenchmarkTest01203": 78804,
  "BenchmarkTest01208": 67772,
  "BenchmarkTest01217": 55865,
  "BenchmarkTest01221": 83404,
  "BenchmarkTest01222": 82396,
  "BenchmarkTest01223": 58965,
  "BenchmarkTest01231": 79823,
  "BenchmarkTest01232": 70213,
  "BenchmarkTest01237": 60847,
  "BenchmarkTest01244": 68243,
  "BenchmarkTest01252": 76806,
  "BenchmarkTest01253": 60051,
  "BenchmarkTest01255": 86032,
  "BenchmarkTest01264": 83033,
  "BenchmarkTest01268": 60078,
  "BenchmarkTest01273": 68023,
  "BenchmarkTest01282": 84014,
  "BenchmarkTest01283": 84186,
  "BenchmarkTest01285": 52219,
  "BenchmarkTest01287": 67765,
  "BenchmarkTest01295": 82754,
  "BenchmarkTest01296": 71862,
  "BenchmarkTest01306": 75019,
  "BenchmarkTest01307": 80484,
  "BenchmarkTest01312": 69780,
  "BenchmarkTest01315": 62889,
  "BenchmarkTest01319": 68653,
  "BenchmarkTest01323": 64807,
  "BenchmarkTest01324": 53492,
  "BenchmarkTest01327": 78642,
  "BenchmarkTest01330": 60273,
  "BenchmarkTest01339": 60099,
  "BenchmarkTest01341": 66901,
  "BenchmarkTest01349": 65201,
  "BenchmarkTest01355": 84313,
  "BenchmarkTest01359": 57157,
  "BenchmarkTest01362": 67848,
  "BenchmarkTest01363": 65888,
  "BenchmarkTest01364": 73604,
  "BenchmarkTest01365": 74700,
  "BenchmarkTest01384": 74414,
  "BenchmarkTest01389": 72790,
  "BenchmarkTest01396": 67062,
  "BenchmarkTest01399": 72594,
  "BenchmarkTest01403": 61011,
  "BenchmarkTest01406": 65505,
  "BenchmarkTest01414": 66799,
  "BenchmarkTest01419": 82959,
  "BenchmarkTest01422": 83769,
  "BenchmarkTest01423": 84575,
  "BenchmarkTest01425": 84276,
  "BenchmarkTest01433": 80281,
  "BenchmarkTest01435": 82156,
  "BenchmarkTest01440": 76562,
  "BenchmarkTest01441": 75067,
  "BenchmarkTest01444": 68499,
  "BenchmarkTest01449": 52726,
  "BenchmarkTest01453": 58144,
  "BenchmarkTest01454": 73405,
  "BenchmarkTest01455": 59033,
  "BenchmarkTest01456": 53236,
  "BenchmarkTest01461": 53333,
  "BenchmarkTest01464": 84604,
  "BenchmarkTest01469": 58292,
  "BenchmarkTest01473": 65937,
  "BenchmarkTest01475": 76184,
  "BenchmarkTest01476": 78897,
  "BenchmarkTest01477": 80142,
  "BenchmarkTest01484": 81690,
  "BenchmarkTest01488": 84917,
  "BenchmarkTest01490": 72619,
  "BenchmarkTest01494": 81628,
  "BenchmarkTest01507": 76215,
  "BenchmarkTest01511": 75036,
  "BenchmarkTest01513": 62072,
  "BenchmarkTest01515": 61482,
  "BenchmarkTest01517": 66743,
  "BenchmarkTest01520": 70431,
  "BenchmarkTest01523": 76663,
  "BenchmarkTest01525": 69212,
  "BenchmarkTest01528": 84833,
  "BenchmarkTest01533": 60172,
  "BenchmarkTest01535": 62741,
  "BenchmarkTest01536": 83559,
  "BenchmarkTest01541": 76515,
  "BenchmarkTest01549": 78155,
  "BenchmarkTest01552": 76171,
  "BenchmarkTest01555": 59542,
  "BenchmarkTest01564": 54737,
  "BenchmarkTest01566": 56289,
  "BenchmarkTest01576": 55279,
  "BenchmarkTest01580": 65480,
  "BenchmarkTest01585": 52646,
  "BenchmarkTest01596": 61891,
  "BenchmarkTest01598": 79099,
  "BenchmarkTest01605": 63484,
  "BenchmarkTest01608": 81613,
  "BenchmarkTest01618": 58864,
  "BenchmarkTest01622": 76208,
  "BenchmarkTest01630": 75331,
  "BenchmarkTest01634": 81544,
  "BenchmarkTest01639": 83160,
  "BenchmarkTest01654": 65057,
  "BenchmarkTest01664": 56651,
  "BenchmarkTest01665": 57790,
  "BenchmarkTest01666": 82223,
  "BenchmarkTest01667": 68918,
  "BenchmarkTest01677": 73025,
  "BenchmarkTest01685": 76941,
  "BenchmarkTest01687": 78412,
  "BenchmarkTest01691": 78701,
  "BenchmarkTest01699": 82065,
  "BenchmarkTest01701": 58173,
  "BenchmarkTest01705": 75043,
  "BenchmarkTest01709": 65948,
  "BenchmarkTest01713": 72990,
  "BenchmarkTest01716": 60798,
  "BenchmarkTest01719": 62372,
  "BenchmarkTest01724": 85384,
  "BenchmarkTest01725": 73503,
  "BenchmarkTest01730": 54968,
  "BenchmarkTest01747": 60653,
  "BenchmarkTest01752": 74449,
  "BenchmarkTest01757": 67709,
  "BenchmarkTest01761": 51802,
  "BenchmarkTest01765": 72968,
  "BenchmarkTest01767": 59860,
  "BenchmarkTest01768": 69880,
  "BenchmarkTest01772": 61087,
  "BenchmarkTest01775": 55152,
  "BenchmarkTest01778": 85218,
  "BenchmarkTest01794": 53906,
  "BenchmarkTest01796": 54286,
  "BenchmarkTest01798": 56942,
  "BenchmarkTest01799": 65256,
  "BenchmarkTest01806": 59926,
  "BenchmarkTest01814": 70562,
  "BenchmarkTest01818": 73290,
  "BenchmarkTest01822": 74845,
  "BenchmarkTest01829": 65653,
  "BenchmarkTest01842": 66703,
  "BenchmarkTest01843": 80488,
  "BenchmarkTest01846": 54620,
  "BenchmarkTest01850": 53795,
  "BenchmarkTest01854": 71347,
  "BenchmarkTest01858": 78986,
  "BenchmarkTest01860": 76529,
  "BenchmarkTest01865": 60522,
  "BenchmarkTest01875": 80878,
  "BenchmarkTest01879": 82115,
  "BenchmarkTest01889": 73253,
  "BenchmarkTest01899": 64724,
  "BenchmarkTest01905": 72302,
  "BenchmarkTest01909": 59798,
  "BenchmarkTest01934": 58200,
  "BenchmarkTest01938": 84494,
  "BenchmarkTest01940": 84701,
  "BenchmarkTest01942": 53432,
  "BenchmarkTest01945": 62987,
  "BenchmarkTest01947": 71154,
  "BenchmarkTest01958": 74304,
  "BenchmarkTest01965": 75152,
  "BenchmarkTest01970": 54212,
  "BenchmarkTest02022": 78766,
  "BenchmarkTest02023": 58542,
  "BenchmarkTest02025": 67303,
  "BenchmarkTest02028": 66146,
  "BenchmarkTest02031": 74757,
  "BenchmarkTest02037": 58798,
  "BenchmarkTest02042": 68952,
  "BenchmarkTest02043": 55403,
  "BenchmarkTest02062": 56498,
  "BenchmarkTest02067": 66285,
  "BenchmarkTest02068": 63314,
  "BenchmarkTest02071": 77412,
  "BenchmarkTest02074": 69994,
  "BenchmarkTest02078": 85186,
  "BenchmarkTest02082": 58365,
  "BenchmarkTest02089": 56958,
  "BenchmarkTest02094": 64669,
  "BenchmarkTest02095": 55993,
  "BenchmarkTest02097": 66325,
  "BenchmarkTest02107": 80479,
  "BenchmarkTest02108": 76821,
  "BenchmarkTest02109": 81385,
  "BenchmarkTest02114": 76320,
  "BenchmarkTest02122": 61823,
  "BenchmarkTest02127": 70041,
  "BenchmarkTest02128": 54472,
  "BenchmarkTest02137": 72400,
  "BenchmarkTest02143": 60000,
  "BenchmarkTest02144": 80786,
  "BenchmarkTest02146": 53302,
  "BenchmarkTest02166": 65047,
  "BenchmarkTest02168": 81893,
  "BenchmarkTest02172": 64395,
  "BenchmarkTest02181": 84798,
  "BenchmarkTest02185": 58178,
  "BenchmarkTest02186": 76958,
  "BenchmarkTest02190": 76582,
  "BenchmarkTest02192": 76380,
  "BenchmarkTest02193": 61108,
  "BenchmarkTest02196": 81805,
  "BenchmarkTest02197": 61788,
  "BenchmarkTest02199": 69377,
  "BenchmarkTest02201": 51673,
  "BenchmarkTest02202": 71324,
  "BenchmarkTest02206": 85997,
  "BenchmarkTest02209": 85882,
  "BenchmarkTest02211": 85512,
  "BenchmarkTest02213": 61377,
  "BenchmarkTest02215": 71275,
  "BenchmarkTest02225": 76993,
  "BenchmarkTest02226": 67598,
  "BenchmarkTest02227": 59925,
  "BenchmarkTest02231": 77735,
  "BenchmarkTest02242": 61700,
  "BenchmarkTest02248": 63368,
  "BenchmarkTest02255": 75113,
  "BenchmarkTest02258": 82894,
  "BenchmarkTest02266": 51594,
  "BenchmarkTest02271": 55733,
  "BenchmarkTest02273": 57159,
  "BenchmarkTest02283": 60095,
  "BenchmarkTest02292": 58248,
  "BenchmarkTest02296": 80135,
  "BenchmarkTest02308": 59894,
  "BenchmarkTest02311": 84914,
  "BenchmarkTest02319": 82866,
  "BenchmarkTest02320": 61622,
  "BenchmarkTest02327": 79515,
  "BenchmarkTest02328": 55112,
  "BenchmarkTest02329": 62014,
  "BenchmarkTest02333": 73952,
  "BenchmarkTest02339": 53800,
  "BenchmarkTest02346": 57932,
  "BenchmarkTest02347": 71921,
  "BenchmarkTest02355": 62605,
  "BenchmarkTest02356": 53369,
  "BenchmarkTest02357": 73413,
  "BenchmarkTest02361": 69546,
  "BenchmarkTest02362": 70514,
  "BenchmarkTest02375": 72518,
  "BenchmarkTest02380": 59521,
  "BenchmarkTest02399": 67620,
  "BenchmarkTest02407": 83920,
  "BenchmarkTest02410": 61004,
  "BenchmarkTest02412": 77145,
  "BenchmarkTest02421": 53276,
  "BenchmarkTest02423": 51964,
  "BenchmarkTest02427": 81149,
  "BenchmarkTest02429": 68665,
  "BenchmarkTest02443": 79524,
  "BenchmarkTest02446": 53134,
  "BenchmarkTest02469": 75065,
  "BenchmarkTest02471": 85899,
  "BenchmarkTest02474": 85567,
  "BenchmarkTest02479": 67433,
  "BenchmarkTest02496": 77998,
  "BenchmarkTest02500": 58083,
  "BenchmarkTest02504": 71893,
  "BenchmarkTest02505": 80155,
  "BenchmarkTest02523": 58665,
  "BenchmarkTest02524": 70764,
  "BenchmarkTest02526": 71697,
  "BenchmarkTest02535": 78169,
  "BenchmarkTest02538": 81161,
  "BenchmarkTest02551": 62762,
  "BenchmarkTest02552": 54054,
  "BenchmarkTest02560": 81534,
  "BenchmarkTest02565": 73734,
  "BenchmarkTest02569": 57920,
  "BenchmarkTest02574": 52734,
  "BenchmarkTest02575": 51895,
  "BenchmarkTest02576": 65473,
  "BenchmarkTest02577": 82029,
  "BenchmarkTest02586": 55557,
  "BenchmarkTest02588": 79820,
  "BenchmarkTest02598": 81460,
  "BenchmarkTest02599": 65831,
  "BenchmarkTest02600": 73282,
  "BenchmarkTest02604": 73024,
  "BenchmarkTest02609": 59913,
  "BenchmarkTest02619": 85710,
  "BenchmarkTest02622": 56416,
  "BenchmarkTest02624": 67421,
  "BenchmarkTest02627": 82494,
  "BenchmarkTest02641": 57456,
  "BenchmarkTest02643": 71994,
  "BenchmarkTest02652": 82604,
  "BenchmarkTest02656": 52935,
  "BenchmarkTest02663": 84031,
  "BenchmarkTest02667": 77659,
  "BenchmarkTest02668": 82590,
  "BenchmarkTest02672": 84162,
  "BenchmarkTest02677": 85185,
  "BenchmarkTest02678": 66185,
  "BenchmarkTest02684": 53230,
  "BenchmarkTest02685": 52753,
  "BenchmarkTest02690": 51755,
  "BenchmarkTest02699": 71684,
  "BenchmarkTest02706": 74231,
  "BenchmarkTest02713": 67273,
  "BenchmarkTest02719": 79183,
  "BenchmarkTest02722": 84318,
  "BenchmarkTest02730": 73122,
  "BenchmarkTest02732": 71289,
  "BenchmarkTest02734": 80243,
  "Benign": 83945,
  "BindingMessageInfo": 74088,
  "BindingMessageInfo.class": 69333,
  "BindingOperationInfo": 64844,
  "BindingOperationInfo.class": 70075,
  "Bitbucket": 69005,
  "BitbucketEndpointConfiguration": 80065,
  "BitbucketEndpointConfiguration.get": 78336,
  "BitbucketEndpointConfiguration.normalizeServerUrl": 53814,
  "BitbucketServerApi.MINIMUM_SUPPORTED_VERSION": 54410,
  "BitbucketServerApi.getVersion": 69730,
  "BitbucketServerApi.isSupportedVersion": 56437,
  "BitbucketServerEndpoint": 65912,
  "BitbucketServerEndpoint.API_URL": 57928,
  "BlockedItem": 78710,
  "Boolean.TRUE": 76091,
  "Boolean.TRUE.equals": 75462,
  "Boolean.class": 59385,
  "Boolean.parseBoolean": 85860,
  "BroadcastFilter": 63870,
  "BrokeredIdentityContext": 64656,
  "Buck": 76565,
  "BufferUtil.EMPTY_BUFFER": 52565,
  "BufferUtil.append": 84402,
  "BufferUtil.clear": 70542,
  "BufferUtil.compact": 56682,
  "BufferUtil.flipToFill": 68975,
  "BufferUtil.flipToFlush": 80420,
  "BufferUtil.hasContent": 62383,
  "BufferUtil.isEmpty": 66574,
  "BufferUtil.space": 82807,
  "BufferUtil.toDetailString": 71568,
  "BufferUtil.toSummaryString": 80471,
  "BufferedImage": 60582,
  "BufferedInputStream": 76505,
  "BufferedOutputStream": 82224,
  "BufferedReader": 75664,
  "BufferedWriter": 83421,
  "BuildDependenceManager.class": 71480,
  "BuildListener": 84982,
  "BuildManager.class": 66281,
  "BuildNotificationManager.class": 68663,
  "BuildParamManager.class": 77291,
  "BuildQuerySettingManager.class": 55854,
  "BuildWrapper": 55188,
  "BuildableItem": 61286,
  "BulkChange": 65112,
  "BusFactory.getDefaultBus": 61166,
  "Byron": 61782,
  "Byte.MAX_VALUE": 56413,
  "Byte.MAX_VALUE/2": 81168,
  "Byte.MIN_VALUE": 64585,
  "Byte.MIN_VALUE/2": 76033,
  "Byte.parseByte": 74011,
  "ByteArrayInputStream": 54175,
  "ByteArrayOutputStream": 66931,
  "ByteBuf": 63211,
  "ByteBufUtil.encodeString": 69980,
  "ByteChunk": 58059,
  "ByteStreams.copy": 65068,
  "C3P0Config": 66060,
  "C3P0Config.getPropsFileConfigProperty": 54416,
  "C3P0ConfigUtils.configFromFlatDefaults": 58081,
  "C3P0ConfigUtils.extractC3P0PropertiesResources": 78466,
  "C3P0ConfigUtils.extractHardcodedC3P0Defaults": 57743,
  "C3P0ConfigUtils.findAllC3P0SystemProperties": 84172,
  "C3P0ConfigXmlUtils.XML_CONFIG_RSRC_PATH": 62403,
  "C3P0ConfigXmlUtils.extractXmlConfigFromDefaultResource": 57225,
  "C3P0ConfigXmlUtils.extractXmlConfigFromInputStream": 64822,
  "CAS_PROCESSOR_ELEMENT.equals": 68963,
  "CAS_PROCESSOR_FOLDER_ATTRIBUTE": 79421,
  "CHAIN_HISTORY": 75429,
  "CHANNEL_SUBSCRIBER_ATTRIBUTE_KEY": 82102,
  "CIPHER_INPUT": 53382,
  "CIPHER_INPUT.getBytes": 58090,
  "CLASSLOADER_RESOURCE_PREFIX": 64314,
  "CLASSLOADER_RESOURCE_PREFIX.length": 65759,
  "CLIENT_CERT_KEY": 67837,
  "CLOSED_NOT_HANDSHAKING": 62406,
  "CLOSE_NOTIFY": 86370,
  "CN=": 55534,
  "CONFIGURE": 66020,
  "CONFIG_ELEMENT.equals": 53026,
  "CONNECTION_PASSWORD": 64016,
  "CONNECTION_TIMEOUT": 52908,
  "CONNECTION_USERNAME": 83162,
  "CORPUS_ELEMENT.equals": 71098,
  "CORPUS_FOLDER_ATTRIBUTE": 59294,
  "CWE395": 85681,
  "CWE586_Explicit_Call_to_Finalize__basic_Helper": 76934,
  "CWE690": 80953,
  "CWE690_NULL_Deref_From_Return__Class_Helper.getStringBad": 83290,
  "CWE690_NULL_Deref_From_Return__Class_Helper.getStringBuilderBad": 56086,
  "CWE690_NULL_Deref_From_Return__Class_Helper.getStringBuilderGood": 69657,
  "CWE690_NULL_Deref_From_Return__Class_Helper.getStringGood": 66836,
  "CWE765_Multiple_Unlocks__ReentrantLock_Thread_01.helperBad": 55612,
  "CWE832_Unlock_Not_Locked__ReentrantLock_Thread_01.helperBad": 60628,
  "CWE832_Unlock_Not_Locked__ReentrantLock_Thread_01.helperGood1": 75207,
  "CXFRequestData": 82631,
  "Calendar.HOUR_OF_DAY": 65645,
  "Calendar.MINUTE": 85494,
  "Calendar.SECOND": 81766,
  "Calendar.YEAR": 78243,
  "Calendar.getInstance": 62232,
  "CalendarField": 68780,
  "CalendarField.ADJUST_ORDER": 62154,
  "CallbackHandler": 79406,
  "CamelContext": 74988,
  "CarbonPacketExtension": 75329,
  "CarbonPacketExtension.NAMESPACE": 57661,
  "CarbonPacketExtension.SENT_ELEMENT_NAME": 62838,
  "CasEditorPlugin.ID": 80004,
  "CastUtils.cast": 75691,
  "Ccm": 69297,
  "Ccm.class": 71435,
  "CcmParser.class.getClassLoader": 67979,
  "CertificateException": 60455,
  "Chaining": 55960,
  "ChannelHandlerContext": 62767,
  "CharBuffer": 76059,
  "CharBuffer.wrap": 69496,
  "Character.digit": 70422,
  "Character.isDigit": 55391,
  "Character.toUpperCase": 66406,
  "CharsetUtil.UTF_8": 60192,
  "ChatRoom": 82209,
  "ChatRoomJabberImpl": 83794,
  "ChatRoomMessageDeliveryFailedEvent": 66851,
  "ChatRoomMessageDeliveryFailedEvent.FORBIDDEN": 77362,
  "ChatRoomMessageDeliveryFailedEvent.UNKNOWN_ERROR": 71947,
  "ChunkedOutputStream": 69474,
  "Cipher.DECRYPT_MODE": 84508,
  "Cipher.ENCRYPT_MODE": 70755,
  "Cipher.getInstance": 78957,
  "Class.forName": 80805,
  "ClassLoader.class.isAssignableFrom": 66653,
  "ClassResolver": 79911,
  "ClassUtils.isJavaLanguageInterface": 70702,
  "CliFunctionResult": 63277,
  "ClientAbortException": 70351,
  "ClientAdminEventPublisher": 57501,
  "CloseButtonBehavior": 61146,
  "CloseButtonBehavior.class": 60690,
  "CloseCodes.PROTOCOL_ERROR": 81667,
  "CloseQuoteMissingInTextDecl": 55094,
  "CloseQuoteMissingInXMLDecl": 70464,
  "CloseReason": 73360,
  "CloseableHttpClient": 66157,
  "CloudException": 82776,
  "CloudFactory": 83219,
  "ClusterName.SETTING": 82751,
  "ClusterNodeInformation": 84319,
  "CodeCommentManager.class": 69734,
  "CodeCommentNotificationManager.class": 62609,
  "CodeCommentQuerySettingManager.class": 74352,
  "CodeCommentRelationInfoManager.class": 78934,
  "CodeCommentRelationManager.class": 70408,
  "CodeCommentReplyManager.class": 84017,
  "CodePullAuthorizationSource.class": 76564,
  "CoderResult": 55262,
  "CoderResult.OVERFLOW": 80291,
  "CoderResult.UNDERFLOW": 66782,
  "CoderResult.malformedForLength": 83215,
  "CoderResult.unmappableForLength": 64976,
  "CollectionSearchIndex": 61322,
  "CollectionUtils.isEmpty": 61710,
  "Collections.": 58517,
  "Collections.emptyMap": 63994,
  "Collections.emptySet": 55118,
  "Collections.singleton": 51900,
  "Collections.singletonMap": 59735,
  "Collectors.toUnmodifiableList": 62486,
  "Column1": 58942,
  "Column2": 71548,
  "CommandContext": 53420,
  "CommandRunnerParams": 65938,
  "CommitInfoManager.class": 61814,
  "CommitNotificationManager.class": 70627,
  "CommitQuerySettingManager.class": 66934,
  "ComponentLog": 76936,
  "CompositeClassLoader": 76126,
  "CompositeName": 84246,
  "Computer.threadPoolForRemoting": 66339,
  "ConcurrentHashMap": 66831,
  "ConfigKey.DISPATCHER_CLASSES": 86099,
  "ConfigKey.DISPATCHER_CLASSES.getKeyValue": 74228,
  "Configuration.CACHE_STORAGE_KEY": 75833,
  "Configuration.TEMPLATE_UPDATE_DELAY_KEY": 62860,
  "Configuration.VERSION_2_3_0": 78615,
  "ConfigurationManager": 83518,
  "ConnectTimeoutException": 84210,
  "ConnectionIdleTimeout": 68209,
  "ConnectionIdleTimeout.of": 72250,
  "ConnectionSocketFactory": 79832,
  "ConsoleAnnotator": 82876,
  "Constants.CLOSE": 75468,
  "Constants.CONNECTION": 58534,
  "Constants.IDENTITY_FILTER": 86376,
  "Constants.INSTALLED_APP_URL": 60707,
  "Constants.INSTALLED_APP_URL.length": 85422,
  "Constants.INSTALLED_APP_URN.equals": 75529,
  "Constants.IS_SECURITY_ENABLED": 69133,
  "Constants.KEEP_ALIVE_HEADER_VALUE_TOKEN": 75367,
  "Constants.SC_A_ARE_DONE": 65088,
  "Constants.SC_A_AUTH_TYPE": 78818,
  "Constants.SC_A_CONTEXT": 62257,
  "Constants.SC_A_JVM_ROUTE": 77484,
  "Constants.SC_A_QUERY_STRING": 54916,
  "Constants.SC_A_REMOTE_USER": 79702,
  "Constants.SC_A_REQ_ATTRIBUTE": 63518,
  "Constants.SC_A_REQ_LOCAL_ADDR": 79469,
  "Constants.SC_A_REQ_REMOTE_PORT": 85774,
  "Constants.SC_A_SECRET": 51466,
  "Constants.SC_A_SERVLET_PATH": 63273,
  "Constants.SC_A_SSL_CERT": 52789,
  "Constants.SC_A_SSL_CIPHER": 72602,
  "Constants.SC_A_SSL_KEY_SIZE": 70181,
  "Constants.SC_A_SSL_PROTOCOL": 77895,
  "Constants.SC_A_SSL_SESSION": 68642,
  "Constants.SC_A_STORED_METHOD": 57005,
  "Constants.SC_M_JK_STORED": 79219,
  "Constants.SC_REQ_CONTENT_LENGTH": 71943,
  "Constants.SC_REQ_CONTENT_TYPE": 79228,
  "Constants.VOID_FILTER": 80055,
  "Constants.XML_BLOCK_EXTERNAL_INIT_PARAM": 67018,
  "Constants.getHeaderForCode": 81270,
  "Constants.getMethodForCode": 72922,
  "Constants.pluginServer": 69271,
  "Consumes": 57041,
  "ContactJabberImpl": 77827,
  "ContactResource": 70922,
  "ContainsFilter": 57711,
  "Content-Encoding": 78869,
  "Content-Length": 59853,
  "Content-Range": 51697,
  "Content-Type": 72874,
  "ContentHandler": 62180,
  "ContentHeaderBody": 51553,
  "Context.INITIAL_CONTEXT_FACTORY": 75880,
  "Context.PROVIDER_URL": 77293,
  "Context.REFERRAL": 52031,
  "Context.SECURITY_AUTHENTICATION": 83918,
  "Context.SECURITY_CREDENTIALS": 77393,
  "Context.SECURITY_PRINCIPAL": 73542,
  "Context.getCurrentLogger": 55068,
  "ContextLogger.LOG.catchingDebug": 61617,
  "ContextLogger.LOG.destroyingContextAfterBeanStoreAttachError": 51966,
  "Continuing": 56877,
  "ControlCommand": 77852,
  "ConversationLogger.LOG.contextNotActive": 74494,
  "ConversationLogger.LOG.conversationNamingSchemeNotFound": 55899,
  "ConversationLogger.LOG.mustCallAssociateBeforeDeactivate": 62992,
  "ConversationNamingScheme": 85371,
  "ConversationNamingScheme.PARAMETER_NAME": 84521,
  "Converter.class": 81778,
  "Cookie.cookie": 58358,
  "Copying": 72833,
  "CoreAttributes.FILENAME.key": 68601,
  "CoreException": 54347,
  "CreateApiKeyRequest": 63710,
  "CreateApiKeyResponse": 77991,
  "Credential.MD5": 85380,
  "CronEntry": 64770,
  "CryptoException": 80034,
  "DAY_OF_MONTH": 72181,
  "DAY_OF_WEEK": 85113,
  "DEFAULT_MIME_TYPE": 81008,
  "DES/CBC/PKCS5PADDING": 82652,
  "DES/CBC/PKCS5Padding": 72663,
  "DESede": 63279,
  "DESede/ECB/PKCS5Padding": 68478,
  "DIGEST-MD5": 70368,
  "DIGITS_BY_BASE_THAT_FIT_IN_63B": 54807,
  "DIY_CHUNKING": 58011,
  "DOM2Writer.nodeToString": 57560,
  "DOMSource": 84564,
  "DataByteArrayInputStream": 70196,
  "DataInputStream": 69481,
  "DataManager.class": 81647,
  "DefaultAttachmentStorageManager.class": 62613,
  "DefaultBatchWorkManager.class": 67632,
  "DefaultBuildDependenceManager.class": 86359,
  "DefaultBuildManager.class": 65436,
  "DefaultBuildParamManager.class": 78856,
  "DefaultBuildQuerySettingManager.class": 62958,
  "DefaultCodeCommentManager.class": 55087,
  "DefaultCodeCommentQuerySettingManager.class": 76560,
  "DefaultCodeCommentRelationInfoManager.class": 80446,
  "DefaultCodeCommentRelationManager.class": 68180,
  "DefaultCodeCommentReplyManager.class": 70502,
  "DefaultCommitInfoManager.class": 83623,
  "DefaultCommitQuerySettingManager.class": 81703,
  "DefaultContext.RequestConstants": 61081,
  "DefaultContext.start": 73874,
  "DefaultDataManager.class": 63066,
  "DefaultEncoding": 69149,
  "DefaultEntityValidator.class": 70418,
  "DefaultGroupAuthorizationManager.class": 67738,
  "DefaultGroupManager.class": 81577,
  "DefaultHttpHeaders": 72122,
  "DefaultIndexManager.class": 86290,
  "DefaultIssueChangeManager.class": 62990,
  "DefaultIssueCommentManager.class": 68067,
  "DefaultIssueFieldManager.class": 85398,
  "DefaultIssueManager.class": 77923,
  "DefaultIssueQuerySettingManager.class": 62183,
  "DefaultIssueVoteManager.class": 77644,
  "DefaultIssueWatchManager.class": 69655,
  "DefaultJettyRunner.class": 83714,
  "DefaultJobManager.class": 63213,
  "DefaultLogManager.class": 81922,
  "DefaultMailManager.class": 68638,
  "DefaultMarkdownManager.class": 58279,
  "DefaultMembershipManager.class": 65254,
  "DefaultMilestoneManager.class": 71772,
  "DefaultProjectManager.class": 58184,
  "DefaultPullRequestBuildManager.class": 72397,
  "DefaultPullRequestChangeManager.class": 64143,
  "DefaultPullRequestCommentManager.class": 67466,
  "DefaultPullRequestManager.class": 58670,
  "DefaultPullRequestQuerySettingManager.class": 75141,
  "DefaultPullRequestReviewManager.class": 82416,
  "DefaultPullRequestUpdateManager.class": 75278,
  "DefaultPullRequestWatchManager.class": 78114,
  "DefaultRequest": 76145,
  "DefaultResponse": 78039,
  "DefaultResponseTransmitter": 79280,
  "DefaultResponseTransmitter.ATTRIBUTE_KEY": 65777,
  "DefaultRoleManager.class": 81012,
  "DefaultSearchManager.class": 58777,
  "DefaultServlet.serveFile": 58749,
  "DefaultServlet.serveResource": 85353,
  "DefaultSettingManager.class": 57836,
  "DefaultStorageManager.class": 83582,
  "DefaultTaskScheduler.class": 60179,
  "DefaultUserAuthorizationManager.class": 75920,
  "DefaultUserInfoManager.class": 68450,
  "DefaultUserManager.class": 54214,
  "DefaultWorkExecutor.class": 72136,
  "DelayInfo": 78526,
  "DelayInformation": 58974,
  "DepthXMLStreamReader": 55454,
  "DescribingHandler": 74769,
  "DescribingHandlers.describeTo": 52239,
  "Descriptor.FormException": 56725,
  "DeserializationConfig": 62260,
  "DeserializationContext": 63788,
  "Details.class": 83286,
  "DeviceConnectionConstants.FIELD_ADAPTER_INSTANCE_ID": 51997,
  "DeviceConnectionConstants.FIELD_PAYLOAD_DEVICE_ID": 67734,
  "DigestAlgorithm": 83707,
  "DigestAlgorithm.MD5": 61519,
  "DigestAlgorithm.forName": 51668,
  "DigestAuthorizationToken": 68672,
  "DigestAuthorizationToken.ALGORITHM": 57055,
  "DigestAuthorizationToken.ALGORITHM.getName": 84972,
  "DigestAuthorizationToken.CNONCE": 69228,
  "DigestAuthorizationToken.DIGEST_URI": 57238,
  "DigestAuthorizationToken.MESSAGE_QOP": 58909,
  "DigestAuthorizationToken.MESSAGE_QOP.getName": 59466,
  "DigestAuthorizationToken.NONCE_COUNT": 57617,
  "DigestAuthorizationToken.OPAQUE": 83946,
  "DigestAuthorizationToken.OPAQUE.getName": 71717,
  "DigestAuthorizationToken.REALM": 84553,
  "DigestAuthorizationToken.REALM.getName": 55218,
  "DigestAuthorizationToken.USERNAME": 83981,
  "DigestContext": 63606,
  "DigestContext.ATTACHMENT_KEY": 71839,
  "DigestCredential": 73144,
  "DigestCredentialImpl": 71414,
  "DigestQop": 70887,
  "DigestQop.AUTH": 63123,
  "DigestQop.forName": 72284,
  "Digester": 82621,
  "DirContext": 76552,
  "DiscoveryNode.localNode": 58100,
  "DispatcherType": 56324,
  "DoNotCloseDelegateOutputStream": 85574,
  "DocLiteralInInterceptor": 65972,
  "DocumentBuilder": 67243,
  "DocumentBuilderFactory": 77135,
  "DocumentBuilderFactory.newInstance": 75967,
  "DocumentUtil.getElement": 68623,
  "Donna": 52354,
  "DotCorpus": 66902,
  "Double.class": 74474,
  "Double.parseDouble": 66560,
  "Double.toString": 74732,
  "Doug": 53589,
  "Drink": 61496,
  "DriverManager.getConnection": 78487,
  "DumpDirectoryFiles": 74406,
  "Duplex-HTTP": 82820,
  "EDITOR_ELEMENT.equals": 71034,
  "EDITOR_LINE_LENGTH_ATTRIBUTE": 80543,
  "Endpoint.class": 74912,
  "EntityManager.class": 55682,
  "EntityManagerFactory.class": 72292,
  "EntityReferenceManager.class": 78158,
  "EntityValidator.class": 53808,
  "EntryWriter": 51467,
  "EnumSet.copyOf": 63370,
  "EqRequiredInTextDecl": 74291,
  "EqRequiredInXMLDecl": 81191,
  "ErrorCodes.COMMAND_INVALID": 84454,
  "ErrorCodes.MESSAGE_TOO_LARGE": 83171,
  "ErrorDispatcher": 80295,
  "ErrorMessage.Error": 86055,
  "ErrorMessage.Error.ErrorCodes.ALREADY_EXISTS.toString": 57791,
  "ErrorMessage.Error.ErrorCodes.INVALID.toString": 72188,
  "ErrorMessage.Error.ErrorCodes.MISSING.toString": 69400,
  "ErrorPage.error": 57190,
  "ErrorResponse.exists": 77034,
  "ErrorState.CLOSE_CLEAN": 83078,
  "ErrorType.PARSING_XML_ERROR": 58863,
  "Errors.INVALID_SAML_RESPONSE": 51768,
  "Errors.INVALID_SIGNATURE": 75384,
  "EsExecutors.PROCESSORS": 73232,
  "EventType.IDENTITY_PROVIDER_RESPONSE": 56905,
  "Exception.class": 56588,
  "ExceptionUtils.handleThrowable": 79653,
  "ExceptionUtils.unchecked": 61575,
  "ExecutionException": 53909,
  "ExecutorService": 67650,
  "ExecutorService.class": 77473,
  "ExitCode.COMMANDLINE_ERROR": 75223,
  "ExitCode.SUCCESS": 80259,
  "ExtensionList.lookup": 59772,
  "Extracting": 72176,
  "FAIL_PROPERTY": 73546,
  "FINER": 56252,
  "FORM_REDIRECT_PARAMETER": 85147,
  "FRAGMENT_COUNT.key": 59419,
  "FRAGMENT_ID.key": 68757,
  "FRAGMENT_INDEX.key": 53842,
  "FactoryModuleBuilder": 64089,
  "Fault.FAULT_CODE_CLIENT": 83014,
  "FieldUtils.readField": 80451,
  "File.createTempFile": 69233,
  "File.separator": 78168,
  "File.separatorChar": 64365,
  "FileAnnotation": 66291,
  "FileInputStream": 83216,
  "FileOutputStream": 68668,
  "FileSystem.closeAllForUGI": 79435,
  "FileSystems.getDefault": 60568,
  "FileUtils.contentEquals": 79102,
  "FileUtils.copyInputStreamToFile": 85886,
  "FileUtils.forceDelete": 55027,
  "FileUtils.moveFile": 60898,
  "FileUtils.openOutputStream": 58174,
  "FilenameUtils.getExtension": 74124,
  "FilenameUtils.getName": 75569,
  "FilenameUtils.normalize": 54130,
  "Files.createTempDirectory": 75816,
  "Files.createTempFile": 56798,
  "Files.newOutputStream": 57255,
  "FillState.IDLE": 82387,
  "FilterChain": 80920,
  "FilterChainConfigurator": 65820,
  "FilterChainConfigurator.class": 76657,
  "FilterChainManager": 73903,
  "FilterChainResolver.class": 84392,
  "Float.MAX_VALUE": 83882,
  "Float.MIN_VALUE": 81538,
  "Float.class": 77485,
  "Float.parseFloat": 82201,
  "Float.toString": 55490,
  "FlowFile": 77764,
  "FlowFiles": 81026,
  "Floyd": 61447,
  "FlushState.IDLE": 73809,
  "FlushState.WAIT_FOR_FILL": 57645,
  "Foo=bar": 58895,
  "ForkJoinPool": 79186,
  "ForkJoinPool.class": 83753,
  "ForkJoinTask": 78415,
  "FormApply.success": 84650,
  "FormValidation": 78349,
  "FormValidation.errorWithMarkup": 80124,
  "FormValidation.ok": 59331,
  "ForwardedPacketExtension": 79791,
  "ForwardedPacketExtension.class": 61537,
  "FrameType.HEADERS": 58435,
  "FunctionContext": 64936,
  "FunctionService": 57767,
  "FunctionService.registerFunction": 70841,
  "Functions.printThrowable": 74538,
  "GETTER_SETTER_REFLECTION": 71487,
  "GZIPInputStream": 72501,
  "GalSearchControl": 52821,
  "GalSearchParams": 69011,
  "GalSearchType": 61407,
  "GalSearchType.fromString": 71128,
  "Gayle": 85826,
  "GeneralConstants.SAML_CHARSET": 71988,
  "GeneralSecurityException": 84860,
  "GetGroupsUsingAttribute": 53117,
  "GetResolvedMemberMethods.action": 75897,
  "GitConfig.class": 67930,
  "GitConfigProvider.class": 74184,
  "GitFilter.class": 78453,
  "GitObjectMapperConfigurator.class": 77802,
